Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x276 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x43ab6): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5ff9d): ../Core/Src/fonts.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x29697): C:/Users/Barcala/STM32CubeIDE/workspace_1.10.1/LCD/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x42d9f): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x27168): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x1b15d): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x63be6): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x6d88e): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x2bccd): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0xb9f4): long int
 <1><64>: Abbrev Number: 2 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 7	(unsigned)
    <67>   DW_AT_name        : (indirect string, offset: 0x1f845): long unsigned int
 <1><6b>: Abbrev Number: 2 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 8
    <6d>   DW_AT_encoding    : 5	(signed)
    <6e>   DW_AT_name        : (indirect string, offset: 0x3d3c6): long long int
 <1><72>: Abbrev Number: 2 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 8
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x1baaf): long long unsigned int
 <1><79>: Abbrev Number: 4 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : int
 <1><80>: Abbrev Number: 2 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 4
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : (indirect string, offset: 0xb3a2): unsigned int
 <1><87>: Abbrev Number: 3 (DW_TAG_typedef)
    <88>   DW_AT_name        : (indirect string, offset: 0x2716a): uint8_t
    <8c>   DW_AT_decl_file   : 3
    <8d>   DW_AT_decl_line   : 24
    <8e>   DW_AT_decl_column : 19
    <8f>   DW_AT_type        : <0x30>
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x89af3): uint16_t
    <98>   DW_AT_decl_file   : 3
    <99>   DW_AT_decl_line   : 36
    <9a>   DW_AT_decl_column : 20
    <9b>   DW_AT_type        : <0x4a>
 <1><9f>: Abbrev Number: 5 (DW_TAG_const_type)
    <a0>   DW_AT_type        : <0x93>
 <1><a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0x7c080): size_t
    <a9>   DW_AT_decl_file   : 4
    <aa>   DW_AT_decl_line   : 209
    <ab>   DW_AT_decl_column : 23
    <ac>   DW_AT_type        : <0x80>
 <1><b0>: Abbrev Number: 2 (DW_TAG_base_type)
    <b1>   DW_AT_byte_size   : 8
    <b2>   DW_AT_encoding    : 4	(float)
    <b3>   DW_AT_name        : (indirect string, offset: 0xcbc8): long double
 <1><b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b8>   DW_AT_byte_size   : 4
    <b9>   DW_AT_type        : <0xbd>
 <1><bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <be>   DW_AT_byte_size   : 1
    <bf>   DW_AT_encoding    : 8	(unsigned char)
    <c0>   DW_AT_name        : (indirect string, offset: 0x87717): char
 <1><c4>: Abbrev Number: 5 (DW_TAG_const_type)
    <c5>   DW_AT_type        : <0xbd>
 <1><c9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ca>   DW_AT_byte_size   : 4
    <cb>   DW_AT_type        : <0xc4>
 <1><cf>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d0>   DW_AT_byte_size   : 8
    <d1>   DW_AT_decl_file   : 5
    <d2>   DW_AT_decl_line   : 53
    <d3>   DW_AT_decl_column : 9
    <d4>   DW_AT_sibling     : <0x100>
 <2><d8>: Abbrev Number: 8 (DW_TAG_member)
    <d9>   DW_AT_name        : (indirect string, offset: 0x1a4e4): FontWidth
    <dd>   DW_AT_decl_file   : 5
    <de>   DW_AT_decl_line   : 54
    <df>   DW_AT_decl_column : 10
    <e0>   DW_AT_type        : <0x87>
    <e4>   DW_AT_data_member_location: 0
 <2><e5>: Abbrev Number: 8 (DW_TAG_member)
    <e6>   DW_AT_name        : (indirect string, offset: 0x9f86): FontHeight
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 55
    <ec>   DW_AT_decl_column : 10
    <ed>   DW_AT_type        : <0x87>
    <f1>   DW_AT_data_member_location: 1
 <2><f2>: Abbrev Number: 8 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0x3e815): data
    <f7>   DW_AT_decl_file   : 5
    <f8>   DW_AT_decl_line   : 56
    <f9>   DW_AT_decl_column : 18
    <fa>   DW_AT_type        : <0x100>
    <fe>   DW_AT_data_member_location: 4
 <2><ff>: Abbrev Number: 0
 <1><100>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <101>   DW_AT_byte_size   : 4
    <102>   DW_AT_type        : <0x9f>
 <1><106>: Abbrev Number: 3 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xfe03): FontDef_t
    <10b>   DW_AT_decl_file   : 5
    <10c>   DW_AT_decl_line   : 57
    <10d>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xcf>
 <1><112>: Abbrev Number: 7 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 4
    <114>   DW_AT_decl_file   : 5
    <115>   DW_AT_decl_line   : 62
    <116>   DW_AT_decl_column : 9
    <117>   DW_AT_sibling     : <0x136>
 <2><11b>: Abbrev Number: 8 (DW_TAG_member)
    <11c>   DW_AT_name        : (indirect string, offset: 0x8d249): Length
    <120>   DW_AT_decl_file   : 5
    <121>   DW_AT_decl_line   : 63
    <122>   DW_AT_decl_column : 11
    <123>   DW_AT_type        : <0x93>
    <127>   DW_AT_data_member_location: 0
 <2><128>: Abbrev Number: 8 (DW_TAG_member)
    <129>   DW_AT_name        : (indirect string, offset: 0x9f8a): Height
    <12d>   DW_AT_decl_file   : 5
    <12e>   DW_AT_decl_line   : 64
    <12f>   DW_AT_decl_column : 11
    <130>   DW_AT_type        : <0x93>
    <134>   DW_AT_data_member_location: 2
 <2><135>: Abbrev Number: 0
 <1><136>: Abbrev Number: 3 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0x84758): FONTS_SIZE_t
    <13b>   DW_AT_decl_file   : 5
    <13c>   DW_AT_decl_line   : 65
    <13d>   DW_AT_decl_column : 3
    <13e>   DW_AT_type        : <0x112>
 <1><142>: Abbrev Number: 9 (DW_TAG_variable)
    <143>   DW_AT_name        : (indirect string, offset: 0x16708): Font_7x10
    <147>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 80
    <149>   DW_AT_decl_column : 18
    <14a>   DW_AT_type        : <0x106>
    <14e>   DW_AT_external    : 1
    <14e>   DW_AT_declaration : 1
 <1><14e>: Abbrev Number: 9 (DW_TAG_variable)
    <14f>   DW_AT_name        : (indirect string, offset: 0x3c593): Font_11x18
    <153>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 85
    <155>   DW_AT_decl_column : 18
    <156>   DW_AT_type        : <0x106>
    <15a>   DW_AT_external    : 1
    <15a>   DW_AT_declaration : 1
 <1><15a>: Abbrev Number: 9 (DW_TAG_variable)
    <15b>   DW_AT_name        : (indirect string, offset: 0x31713): Font_16x26
    <15f>   DW_AT_decl_file   : 5
    <160>   DW_AT_decl_line   : 90
    <161>   DW_AT_decl_column : 18
    <162>   DW_AT_type        : <0x106>
    <166>   DW_AT_external    : 1
    <166>   DW_AT_declaration : 1
 <1><166>: Abbrev Number: 10 (DW_TAG_array_type)
    <167>   DW_AT_type        : <0x9f>
    <16b>   DW_AT_sibling     : <0x177>
 <2><16f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <170>   DW_AT_type        : <0x80>
    <174>   DW_AT_upper_bound : 949
 <2><176>: Abbrev Number: 0
 <1><177>: Abbrev Number: 5 (DW_TAG_const_type)
    <178>   DW_AT_type        : <0x166>
 <1><17c>: Abbrev Number: 12 (DW_TAG_variable)
    <17d>   DW_AT_name        : (indirect string, offset: 0x69f9a): Font7x10
    <181>   DW_AT_decl_file   : 1
    <182>   DW_AT_decl_line   : 21
    <183>   DW_AT_decl_column : 16
    <184>   DW_AT_type        : <0x177>
    <188>   DW_AT_external    : 1
    <188>   DW_AT_location    : 5 byte block: 3 b4 5b 0 8 	(DW_OP_addr: 8005bb4)
 <1><18e>: Abbrev Number: 10 (DW_TAG_array_type)
    <18f>   DW_AT_type        : <0x9f>
    <193>   DW_AT_sibling     : <0x19f>
 <2><197>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <198>   DW_AT_type        : <0x80>
    <19c>   DW_AT_upper_bound : 1709
 <2><19e>: Abbrev Number: 0
 <1><19f>: Abbrev Number: 5 (DW_TAG_const_type)
    <1a0>   DW_AT_type        : <0x18e>
 <1><1a4>: Abbrev Number: 12 (DW_TAG_variable)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x2ce9b): Font11x18
    <1a9>   DW_AT_decl_file   : 1
    <1aa>   DW_AT_decl_line   : 119
    <1ab>   DW_AT_decl_column : 16
    <1ac>   DW_AT_type        : <0x19f>
    <1b0>   DW_AT_external    : 1
    <1b0>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1b6>: Abbrev Number: 10 (DW_TAG_array_type)
    <1b7>   DW_AT_type        : <0x9f>
    <1bb>   DW_AT_sibling     : <0x1c7>
 <2><1bf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1c0>   DW_AT_type        : <0x80>
    <1c4>   DW_AT_upper_bound : 2469
 <2><1c6>: Abbrev Number: 0
 <1><1c7>: Abbrev Number: 5 (DW_TAG_const_type)
    <1c8>   DW_AT_type        : <0x1b6>
 <1><1cc>: Abbrev Number: 12 (DW_TAG_variable)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x221cb): Font16x26
    <1d1>   DW_AT_decl_file   : 1
    <1d2>   DW_AT_decl_line   : 217
    <1d3>   DW_AT_decl_column : 16
    <1d4>   DW_AT_type        : <0x1c7>
    <1d8>   DW_AT_external    : 1
    <1d8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1de>: Abbrev Number: 13 (DW_TAG_variable)
    <1df>   DW_AT_specification: <0x142>
    <1e3>   DW_AT_decl_file   : 1
    <1e4>   DW_AT_decl_line   : 316
    <1e6>   DW_AT_decl_column : 11
    <1e7>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><1ed>: Abbrev Number: 13 (DW_TAG_variable)
    <1ee>   DW_AT_specification: <0x14e>
    <1f2>   DW_AT_decl_file   : 1
    <1f3>   DW_AT_decl_line   : 322
    <1f5>   DW_AT_decl_column : 11
    <1f6>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1fc>: Abbrev Number: 13 (DW_TAG_variable)
    <1fd>   DW_AT_specification: <0x15a>
    <201>   DW_AT_decl_file   : 1
    <202>   DW_AT_decl_line   : 328
    <204>   DW_AT_decl_column : 11
    <205>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><20b>: Abbrev Number: 14 (DW_TAG_subprogram)
    <20c>   DW_AT_external    : 1
    <20c>   DW_AT_name        : (indirect string, offset: 0x2da8e): strlen
    <210>   DW_AT_decl_file   : 6
    <211>   DW_AT_decl_line   : 41
    <212>   DW_AT_decl_column : 9
    <213>   DW_AT_prototyped  : 1
    <213>   DW_AT_type        : <0xa4>
    <217>   DW_AT_declaration : 1
    <217>   DW_AT_sibling     : <0x221>
 <2><21b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <21c>   DW_AT_type        : <0xc9>
 <2><220>: Abbrev Number: 0
 <1><221>: Abbrev Number: 16 (DW_TAG_subprogram)
    <222>   DW_AT_external    : 1
    <222>   DW_AT_name        : (indirect string, offset: 0x74635): FONTS_GetStringSize
    <226>   DW_AT_decl_file   : 1
    <227>   DW_AT_decl_line   : 334
    <229>   DW_AT_decl_column : 7
    <22a>   DW_AT_prototyped  : 1
    <22a>   DW_AT_type        : <0xb7>
    <22e>   DW_AT_low_pc      : 0x0
    <232>   DW_AT_high_pc     : 0x3a
    <236>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <238>   DW_AT_GNU_all_tail_call_sites: 1
    <238>   DW_AT_sibling     : <0x26d>
 <2><23c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <23d>   DW_AT_name        : str
    <241>   DW_AT_decl_file   : 1
    <242>   DW_AT_decl_line   : 334
    <244>   DW_AT_decl_column : 33
    <245>   DW_AT_type        : <0xb7>
    <249>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><24c>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <24d>   DW_AT_name        : (indirect string, offset: 0x3fe11): SizeStruct
    <251>   DW_AT_decl_file   : 1
    <252>   DW_AT_decl_line   : 334
    <254>   DW_AT_decl_column : 52
    <255>   DW_AT_type        : <0x26d>
    <259>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><25c>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <25d>   DW_AT_name        : (indirect string, offset: 0x72e50): Font
    <261>   DW_AT_decl_file   : 1
    <262>   DW_AT_decl_line   : 334
    <264>   DW_AT_decl_column : 75
    <265>   DW_AT_type        : <0x273>
    <269>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><26c>: Abbrev Number: 0
 <1><26d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26e>   DW_AT_byte_size   : 4
    <26f>   DW_AT_type        : <0x136>
 <1><273>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <274>   DW_AT_byte_size   : 4
    <275>   DW_AT_type        : <0x106>
 <1><279>: Abbrev Number: 0
  Compilation Unit @ offset 0x27a:
   Length:        0x153e (32-bit)
   Version:       4
   Abbrev Offset: 0x111
   Pointer Size:  4
 <0><285>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <286>   DW_AT_producer    : (indirect string, offset: 0x43ab6): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <28a>   DW_AT_language    : 12	(ANSI C99)
    <28b>   DW_AT_name        : (indirect string, offset: 0x8a879): ../Core/Src/main.c
    <28f>   DW_AT_comp_dir    : (indirect string, offset: 0x29697): C:/Users/Barcala/STM32CubeIDE/workspace_1.10.1/LCD/Debug
    <293>   DW_AT_ranges      : 0x10
    <297>   DW_AT_low_pc      : 0x0
    <29b>   DW_AT_stmt_list   : 0x7d4
    <29f>   DW_AT_GNU_macros  : 0x160c9
 <1><2a3>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a4>   DW_AT_byte_size   : 1
    <2a5>   DW_AT_encoding    : 6	(signed char)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x42d9f): signed char
 <1><2aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x27168): __uint8_t
    <2af>   DW_AT_decl_file   : 3
    <2b0>   DW_AT_decl_line   : 43
    <2b1>   DW_AT_decl_column : 24
    <2b2>   DW_AT_type        : <0x2b6>
 <1><2b6>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b7>   DW_AT_byte_size   : 1
    <2b8>   DW_AT_encoding    : 8	(unsigned char)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x1b15d): unsigned char
 <1><2bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <2be>   DW_AT_byte_size   : 2
    <2bf>   DW_AT_encoding    : 5	(signed)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x63be6): short int
 <1><2c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x6d88e): __uint16_t
    <2c9>   DW_AT_decl_file   : 3
    <2ca>   DW_AT_decl_line   : 57
    <2cb>   DW_AT_decl_column : 25
    <2cc>   DW_AT_type        : <0x2d0>
 <1><2d0>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d1>   DW_AT_byte_size   : 2
    <2d2>   DW_AT_encoding    : 7	(unsigned)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x2bccd): short unsigned int
 <1><2d7>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d8>   DW_AT_byte_size   : 4
    <2d9>   DW_AT_encoding    : 5	(signed)
    <2da>   DW_AT_name        : (indirect string, offset: 0xb9f4): long int
 <1><2de>: Abbrev Number: 3 (DW_TAG_typedef)
    <2df>   DW_AT_name        : (indirect string, offset: 0x89316): __uint32_t
    <2e3>   DW_AT_decl_file   : 3
    <2e4>   DW_AT_decl_line   : 79
    <2e5>   DW_AT_decl_column : 25
    <2e6>   DW_AT_type        : <0x2ea>
 <1><2ea>: Abbrev Number: 2 (DW_TAG_base_type)
    <2eb>   DW_AT_byte_size   : 4
    <2ec>   DW_AT_encoding    : 7	(unsigned)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1f845): long unsigned int
 <1><2f1>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f2>   DW_AT_byte_size   : 8
    <2f3>   DW_AT_encoding    : 5	(signed)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x3d3c6): long long int
 <1><2f8>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f9>   DW_AT_byte_size   : 8
    <2fa>   DW_AT_encoding    : 7	(unsigned)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x1baaf): long long unsigned int
 <1><2ff>: Abbrev Number: 4 (DW_TAG_base_type)
    <300>   DW_AT_byte_size   : 4
    <301>   DW_AT_encoding    : 5	(signed)
    <302>   DW_AT_name        : int
 <1><306>: Abbrev Number: 2 (DW_TAG_base_type)
    <307>   DW_AT_byte_size   : 4
    <308>   DW_AT_encoding    : 7	(unsigned)
    <309>   DW_AT_name        : (indirect string, offset: 0xb3a2): unsigned int
 <1><30d>: Abbrev Number: 3 (DW_TAG_typedef)
    <30e>   DW_AT_name        : (indirect string, offset: 0x2716a): uint8_t
    <312>   DW_AT_decl_file   : 4
    <313>   DW_AT_decl_line   : 24
    <314>   DW_AT_decl_column : 19
    <315>   DW_AT_type        : <0x2aa>
 <1><319>: Abbrev Number: 3 (DW_TAG_typedef)
    <31a>   DW_AT_name        : (indirect string, offset: 0x89af3): uint16_t
    <31e>   DW_AT_decl_file   : 4
    <31f>   DW_AT_decl_line   : 36
    <320>   DW_AT_decl_column : 20
    <321>   DW_AT_type        : <0x2c4>
 <1><325>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <326>   DW_AT_type        : <0x319>
 <1><32a>: Abbrev Number: 6 (DW_TAG_const_type)
    <32b>   DW_AT_type        : <0x319>
 <1><32f>: Abbrev Number: 3 (DW_TAG_typedef)
    <330>   DW_AT_name        : (indirect string, offset: 0x89ad3): uint32_t
    <334>   DW_AT_decl_file   : 4
    <335>   DW_AT_decl_line   : 48
    <336>   DW_AT_decl_column : 20
    <337>   DW_AT_type        : <0x2de>
 <1><33b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <33c>   DW_AT_type        : <0x32f>
 <1><340>: Abbrev Number: 7 (DW_TAG_structure_type)
    <341>   DW_AT_byte_size   : 16
    <342>   DW_AT_decl_file   : 5
    <343>   DW_AT_decl_line   : 291
    <345>   DW_AT_decl_column : 9
    <346>   DW_AT_sibling     : <0x383>
 <2><34a>: Abbrev Number: 8 (DW_TAG_member)
    <34b>   DW_AT_name        : CCR
    <34f>   DW_AT_decl_file   : 5
    <350>   DW_AT_decl_line   : 293
    <352>   DW_AT_decl_column : 17
    <353>   DW_AT_type        : <0x33b>
    <357>   DW_AT_data_member_location: 0
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0x87e3e): CNDTR
    <35d>   DW_AT_decl_file   : 5
    <35e>   DW_AT_decl_line   : 294
    <360>   DW_AT_decl_column : 17
    <361>   DW_AT_type        : <0x33b>
    <365>   DW_AT_data_member_location: 4
 <2><366>: Abbrev Number: 9 (DW_TAG_member)
    <367>   DW_AT_name        : (indirect string, offset: 0x8aeab): CPAR
    <36b>   DW_AT_decl_file   : 5
    <36c>   DW_AT_decl_line   : 295
    <36e>   DW_AT_decl_column : 17
    <36f>   DW_AT_type        : <0x33b>
    <373>   DW_AT_data_member_location: 8
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x88b29): CMAR
    <379>   DW_AT_decl_file   : 5
    <37a>   DW_AT_decl_line   : 296
    <37c>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x33b>
    <381>   DW_AT_data_member_location: 12
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 10 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x8a142): DMA_Channel_TypeDef
    <388>   DW_AT_decl_file   : 5
    <389>   DW_AT_decl_line   : 297
    <38b>   DW_AT_decl_column : 3
    <38c>   DW_AT_type        : <0x340>
 <1><390>: Abbrev Number: 7 (DW_TAG_structure_type)
    <391>   DW_AT_byte_size   : 8
    <392>   DW_AT_decl_file   : 5
    <393>   DW_AT_decl_line   : 299
    <395>   DW_AT_decl_column : 9
    <396>   DW_AT_sibling     : <0x3b7>
 <2><39a>: Abbrev Number: 8 (DW_TAG_member)
    <39b>   DW_AT_name        : ISR
    <39f>   DW_AT_decl_file   : 5
    <3a0>   DW_AT_decl_line   : 301
    <3a2>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x33b>
    <3a7>   DW_AT_data_member_location: 0
 <2><3a8>: Abbrev Number: 9 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x898d1): IFCR
    <3ad>   DW_AT_decl_file   : 5
    <3ae>   DW_AT_decl_line   : 302
    <3b0>   DW_AT_decl_column : 17
    <3b1>   DW_AT_type        : <0x33b>
    <3b5>   DW_AT_data_member_location: 4
 <2><3b6>: Abbrev Number: 0
 <1><3b7>: Abbrev Number: 10 (DW_TAG_typedef)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x87ae7): DMA_TypeDef
    <3bc>   DW_AT_decl_file   : 5
    <3bd>   DW_AT_decl_line   : 303
    <3bf>   DW_AT_decl_column : 3
    <3c0>   DW_AT_type        : <0x390>
 <1><3c4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3c5>   DW_AT_byte_size   : 28
    <3c6>   DW_AT_decl_file   : 5
    <3c7>   DW_AT_decl_line   : 358
    <3c9>   DW_AT_decl_column : 9
    <3ca>   DW_AT_sibling     : <0x431>
 <2><3ce>: Abbrev Number: 8 (DW_TAG_member)
    <3cf>   DW_AT_name        : CRL
    <3d3>   DW_AT_decl_file   : 5
    <3d4>   DW_AT_decl_line   : 360
    <3d6>   DW_AT_decl_column : 17
    <3d7>   DW_AT_type        : <0x33b>
    <3db>   DW_AT_data_member_location: 0
 <2><3dc>: Abbrev Number: 8 (DW_TAG_member)
    <3dd>   DW_AT_name        : CRH
    <3e1>   DW_AT_decl_file   : 5
    <3e2>   DW_AT_decl_line   : 361
    <3e4>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0x33b>
    <3e9>   DW_AT_data_member_location: 4
 <2><3ea>: Abbrev Number: 8 (DW_TAG_member)
    <3eb>   DW_AT_name        : IDR
    <3ef>   DW_AT_decl_file   : 5
    <3f0>   DW_AT_decl_line   : 362
    <3f2>   DW_AT_decl_column : 17
    <3f3>   DW_AT_type        : <0x33b>
    <3f7>   DW_AT_data_member_location: 8
 <2><3f8>: Abbrev Number: 8 (DW_TAG_member)
    <3f9>   DW_AT_name        : ODR
    <3fd>   DW_AT_decl_file   : 5
    <3fe>   DW_AT_decl_line   : 363
    <400>   DW_AT_decl_column : 17
    <401>   DW_AT_type        : <0x33b>
    <405>   DW_AT_data_member_location: 12
 <2><406>: Abbrev Number: 9 (DW_TAG_member)
    <407>   DW_AT_name        : (indirect string, offset: 0x86f0a): BSRR
    <40b>   DW_AT_decl_file   : 5
    <40c>   DW_AT_decl_line   : 364
    <40e>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x33b>
    <413>   DW_AT_data_member_location: 16
 <2><414>: Abbrev Number: 8 (DW_TAG_member)
    <415>   DW_AT_name        : BRR
    <419>   DW_AT_decl_file   : 5
    <41a>   DW_AT_decl_line   : 365
    <41c>   DW_AT_decl_column : 17
    <41d>   DW_AT_type        : <0x33b>
    <421>   DW_AT_data_member_location: 20
 <2><422>: Abbrev Number: 9 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x8a54f): LCKR
    <427>   DW_AT_decl_file   : 5
    <428>   DW_AT_decl_line   : 366
    <42a>   DW_AT_decl_column : 17
    <42b>   DW_AT_type        : <0x33b>
    <42f>   DW_AT_data_member_location: 24
 <2><430>: Abbrev Number: 0
 <1><431>: Abbrev Number: 10 (DW_TAG_typedef)
    <432>   DW_AT_name        : (indirect string, offset: 0x8aeff): GPIO_TypeDef
    <436>   DW_AT_decl_file   : 5
    <437>   DW_AT_decl_line   : 367
    <439>   DW_AT_decl_column : 3
    <43a>   DW_AT_type        : <0x3c4>
 <1><43e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <43f>   DW_AT_byte_size   : 36
    <440>   DW_AT_decl_file   : 5
    <441>   DW_AT_decl_line   : 385
    <443>   DW_AT_decl_column : 9
    <444>   DW_AT_sibling     : <0x4c6>
 <2><448>: Abbrev Number: 8 (DW_TAG_member)
    <449>   DW_AT_name        : CR1
    <44d>   DW_AT_decl_file   : 5
    <44e>   DW_AT_decl_line   : 387
    <450>   DW_AT_decl_column : 17
    <451>   DW_AT_type        : <0x33b>
    <455>   DW_AT_data_member_location: 0
 <2><456>: Abbrev Number: 8 (DW_TAG_member)
    <457>   DW_AT_name        : CR2
    <45b>   DW_AT_decl_file   : 5
    <45c>   DW_AT_decl_line   : 388
    <45e>   DW_AT_decl_column : 17
    <45f>   DW_AT_type        : <0x33b>
    <463>   DW_AT_data_member_location: 4
 <2><464>: Abbrev Number: 9 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0x87472): OAR1
    <469>   DW_AT_decl_file   : 5
    <46a>   DW_AT_decl_line   : 389
    <46c>   DW_AT_decl_column : 17
    <46d>   DW_AT_type        : <0x33b>
    <471>   DW_AT_data_member_location: 8
 <2><472>: Abbrev Number: 9 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x87477): OAR2
    <477>   DW_AT_decl_file   : 5
    <478>   DW_AT_decl_line   : 390
    <47a>   DW_AT_decl_column : 17
    <47b>   DW_AT_type        : <0x33b>
    <47f>   DW_AT_data_member_location: 12
 <2><480>: Abbrev Number: 8 (DW_TAG_member)
    <481>   DW_AT_name        : DR
    <484>   DW_AT_decl_file   : 5
    <485>   DW_AT_decl_line   : 391
    <487>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0x33b>
    <48c>   DW_AT_data_member_location: 16
 <2><48d>: Abbrev Number: 8 (DW_TAG_member)
    <48e>   DW_AT_name        : SR1
    <492>   DW_AT_decl_file   : 5
    <493>   DW_AT_decl_line   : 392
    <495>   DW_AT_decl_column : 17
    <496>   DW_AT_type        : <0x33b>
    <49a>   DW_AT_data_member_location: 20
 <2><49b>: Abbrev Number: 8 (DW_TAG_member)
    <49c>   DW_AT_name        : SR2
    <4a0>   DW_AT_decl_file   : 5
    <4a1>   DW_AT_decl_line   : 393
    <4a3>   DW_AT_decl_column : 17
    <4a4>   DW_AT_type        : <0x33b>
    <4a8>   DW_AT_data_member_location: 24
 <2><4a9>: Abbrev Number: 8 (DW_TAG_member)
    <4aa>   DW_AT_name        : CCR
    <4ae>   DW_AT_decl_file   : 5
    <4af>   DW_AT_decl_line   : 394
    <4b1>   DW_AT_decl_column : 17
    <4b2>   DW_AT_type        : <0x33b>
    <4b6>   DW_AT_data_member_location: 28
 <2><4b7>: Abbrev Number: 9 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x88808): TRISE
    <4bc>   DW_AT_decl_file   : 5
    <4bd>   DW_AT_decl_line   : 395
    <4bf>   DW_AT_decl_column : 17
    <4c0>   DW_AT_type        : <0x33b>
    <4c4>   DW_AT_data_member_location: 32
 <2><4c5>: Abbrev Number: 0
 <1><4c6>: Abbrev Number: 10 (DW_TAG_typedef)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x89fd8): I2C_TypeDef
    <4cb>   DW_AT_decl_file   : 5
    <4cc>   DW_AT_decl_line   : 396
    <4ce>   DW_AT_decl_column : 3
    <4cf>   DW_AT_type        : <0x43e>
 <1><4d3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4d4>   DW_AT_byte_size   : 40
    <4d5>   DW_AT_decl_file   : 5
    <4d6>   DW_AT_decl_line   : 424
    <4d8>   DW_AT_decl_column : 9
    <4d9>   DW_AT_sibling     : <0x569>
 <2><4dd>: Abbrev Number: 8 (DW_TAG_member)
    <4de>   DW_AT_name        : CR
    <4e1>   DW_AT_decl_file   : 5
    <4e2>   DW_AT_decl_line   : 426
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x33b>
    <4e9>   DW_AT_data_member_location: 0
 <2><4ea>: Abbrev Number: 9 (DW_TAG_member)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x88f66): CFGR
    <4ef>   DW_AT_decl_file   : 5
    <4f0>   DW_AT_decl_line   : 427
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x33b>
    <4f7>   DW_AT_data_member_location: 4
 <2><4f8>: Abbrev Number: 8 (DW_TAG_member)
    <4f9>   DW_AT_name        : CIR
    <4fd>   DW_AT_decl_file   : 5
    <4fe>   DW_AT_decl_line   : 428
    <500>   DW_AT_decl_column : 17
    <501>   DW_AT_type        : <0x33b>
    <505>   DW_AT_data_member_location: 8
 <2><506>: Abbrev Number: 9 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x88237): APB2RSTR
    <50b>   DW_AT_decl_file   : 5
    <50c>   DW_AT_decl_line   : 429
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x33b>
    <513>   DW_AT_data_member_location: 12
 <2><514>: Abbrev Number: 9 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0x862cb): APB1RSTR
    <519>   DW_AT_decl_file   : 5
    <51a>   DW_AT_decl_line   : 430
    <51c>   DW_AT_decl_column : 17
    <51d>   DW_AT_type        : <0x33b>
    <521>   DW_AT_data_member_location: 16
 <2><522>: Abbrev Number: 9 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x8609a): AHBENR
    <527>   DW_AT_decl_file   : 5
    <528>   DW_AT_decl_line   : 431
    <52a>   DW_AT_decl_column : 17
    <52b>   DW_AT_type        : <0x33b>
    <52f>   DW_AT_data_member_location: 20
 <2><530>: Abbrev Number: 9 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0x8636d): APB2ENR
    <535>   DW_AT_decl_file   : 5
    <536>   DW_AT_decl_line   : 432
    <538>   DW_AT_decl_column : 17
    <539>   DW_AT_type        : <0x33b>
    <53d>   DW_AT_data_member_location: 24
 <2><53e>: Abbrev Number: 9 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x89d19): APB1ENR
    <543>   DW_AT_decl_file   : 5
    <544>   DW_AT_decl_line   : 433
    <546>   DW_AT_decl_column : 17
    <547>   DW_AT_type        : <0x33b>
    <54b>   DW_AT_data_member_location: 28
 <2><54c>: Abbrev Number: 9 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x8648c): BDCR
    <551>   DW_AT_decl_file   : 5
    <552>   DW_AT_decl_line   : 434
    <554>   DW_AT_decl_column : 17
    <555>   DW_AT_type        : <0x33b>
    <559>   DW_AT_data_member_location: 32
 <2><55a>: Abbrev Number: 8 (DW_TAG_member)
    <55b>   DW_AT_name        : CSR
    <55f>   DW_AT_decl_file   : 5
    <560>   DW_AT_decl_line   : 435
    <562>   DW_AT_decl_column : 17
    <563>   DW_AT_type        : <0x33b>
    <567>   DW_AT_data_member_location: 36
 <2><568>: Abbrev Number: 0
 <1><569>: Abbrev Number: 10 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x88494): RCC_TypeDef
    <56e>   DW_AT_decl_file   : 5
    <56f>   DW_AT_decl_line   : 438
    <571>   DW_AT_decl_column : 3
    <572>   DW_AT_type        : <0x4d3>
 <1><576>: Abbrev Number: 7 (DW_TAG_structure_type)
    <577>   DW_AT_byte_size   : 84
    <578>   DW_AT_decl_file   : 5
    <579>   DW_AT_decl_line   : 477
    <57b>   DW_AT_decl_column : 9
    <57c>   DW_AT_sibling     : <0x6a5>
 <2><580>: Abbrev Number: 8 (DW_TAG_member)
    <581>   DW_AT_name        : CR1
    <585>   DW_AT_decl_file   : 5
    <586>   DW_AT_decl_line   : 479
    <588>   DW_AT_decl_column : 17
    <589>   DW_AT_type        : <0x33b>
    <58d>   DW_AT_data_member_location: 0
 <2><58e>: Abbrev Number: 8 (DW_TAG_member)
    <58f>   DW_AT_name        : CR2
    <593>   DW_AT_decl_file   : 5
    <594>   DW_AT_decl_line   : 480
    <596>   DW_AT_decl_column : 17
    <597>   DW_AT_type        : <0x33b>
    <59b>   DW_AT_data_member_location: 4
 <2><59c>: Abbrev Number: 9 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0x60561): SMCR
    <5a1>   DW_AT_decl_file   : 5
    <5a2>   DW_AT_decl_line   : 481
    <5a4>   DW_AT_decl_column : 17
    <5a5>   DW_AT_type        : <0x33b>
    <5a9>   DW_AT_data_member_location: 8
 <2><5aa>: Abbrev Number: 9 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x2abdc): DIER
    <5af>   DW_AT_decl_file   : 5
    <5b0>   DW_AT_decl_line   : 482
    <5b2>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0x33b>
    <5b7>   DW_AT_data_member_location: 12
 <2><5b8>: Abbrev Number: 8 (DW_TAG_member)
    <5b9>   DW_AT_name        : SR
    <5bc>   DW_AT_decl_file   : 5
    <5bd>   DW_AT_decl_line   : 483
    <5bf>   DW_AT_decl_column : 17
    <5c0>   DW_AT_type        : <0x33b>
    <5c4>   DW_AT_data_member_location: 16
 <2><5c5>: Abbrev Number: 8 (DW_TAG_member)
    <5c6>   DW_AT_name        : EGR
    <5ca>   DW_AT_decl_file   : 5
    <5cb>   DW_AT_decl_line   : 484
    <5cd>   DW_AT_decl_column : 17
    <5ce>   DW_AT_type        : <0x33b>
    <5d2>   DW_AT_data_member_location: 20
 <2><5d3>: Abbrev Number: 9 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x62042): CCMR1
    <5d8>   DW_AT_decl_file   : 5
    <5d9>   DW_AT_decl_line   : 485
    <5db>   DW_AT_decl_column : 17
    <5dc>   DW_AT_type        : <0x33b>
    <5e0>   DW_AT_data_member_location: 24
 <2><5e1>: Abbrev Number: 9 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x35494): CCMR2
    <5e6>   DW_AT_decl_file   : 5
    <5e7>   DW_AT_decl_line   : 486
    <5e9>   DW_AT_decl_column : 17
    <5ea>   DW_AT_type        : <0x33b>
    <5ee>   DW_AT_data_member_location: 28
 <2><5ef>: Abbrev Number: 9 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x17a54): CCER
    <5f4>   DW_AT_decl_file   : 5
    <5f5>   DW_AT_decl_line   : 487
    <5f7>   DW_AT_decl_column : 17
    <5f8>   DW_AT_type        : <0x33b>
    <5fc>   DW_AT_data_member_location: 32
 <2><5fd>: Abbrev Number: 8 (DW_TAG_member)
    <5fe>   DW_AT_name        : CNT
    <602>   DW_AT_decl_file   : 5
    <603>   DW_AT_decl_line   : 488
    <605>   DW_AT_decl_column : 17
    <606>   DW_AT_type        : <0x33b>
    <60a>   DW_AT_data_member_location: 36
 <2><60b>: Abbrev Number: 8 (DW_TAG_member)
    <60c>   DW_AT_name        : PSC
    <610>   DW_AT_decl_file   : 5
    <611>   DW_AT_decl_line   : 489
    <613>   DW_AT_decl_column : 17
    <614>   DW_AT_type        : <0x33b>
    <618>   DW_AT_data_member_location: 40
 <2><619>: Abbrev Number: 8 (DW_TAG_member)
    <61a>   DW_AT_name        : ARR
    <61e>   DW_AT_decl_file   : 5
    <61f>   DW_AT_decl_line   : 490
    <621>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0x33b>
    <626>   DW_AT_data_member_location: 44
 <2><627>: Abbrev Number: 8 (DW_TAG_member)
    <628>   DW_AT_name        : RCR
    <62c>   DW_AT_decl_file   : 5
    <62d>   DW_AT_decl_line   : 491
    <62f>   DW_AT_decl_column : 17
    <630>   DW_AT_type        : <0x33b>
    <634>   DW_AT_data_member_location: 48
 <2><635>: Abbrev Number: 9 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0xffc9): CCR1
    <63a>   DW_AT_decl_file   : 5
    <63b>   DW_AT_decl_line   : 492
    <63d>   DW_AT_decl_column : 17
    <63e>   DW_AT_type        : <0x33b>
    <642>   DW_AT_data_member_location: 52
 <2><643>: Abbrev Number: 9 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x38459): CCR2
    <648>   DW_AT_decl_file   : 5
    <649>   DW_AT_decl_line   : 493
    <64b>   DW_AT_decl_column : 17
    <64c>   DW_AT_type        : <0x33b>
    <650>   DW_AT_data_member_location: 56
 <2><651>: Abbrev Number: 9 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x668e8): CCR3
    <656>   DW_AT_decl_file   : 5
    <657>   DW_AT_decl_line   : 494
    <659>   DW_AT_decl_column : 17
    <65a>   DW_AT_type        : <0x33b>
    <65e>   DW_AT_data_member_location: 60
 <2><65f>: Abbrev Number: 9 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x87dc): CCR4
    <664>   DW_AT_decl_file   : 5
    <665>   DW_AT_decl_line   : 495
    <667>   DW_AT_decl_column : 17
    <668>   DW_AT_type        : <0x33b>
    <66c>   DW_AT_data_member_location: 64
 <2><66d>: Abbrev Number: 9 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x3dd12): BDTR
    <672>   DW_AT_decl_file   : 5
    <673>   DW_AT_decl_line   : 496
    <675>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0x33b>
    <67a>   DW_AT_data_member_location: 68
 <2><67b>: Abbrev Number: 8 (DW_TAG_member)
    <67c>   DW_AT_name        : DCR
    <680>   DW_AT_decl_file   : 5
    <681>   DW_AT_decl_line   : 497
    <683>   DW_AT_decl_column : 17
    <684>   DW_AT_type        : <0x33b>
    <688>   DW_AT_data_member_location: 72
 <2><689>: Abbrev Number: 9 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x730c8): DMAR
    <68e>   DW_AT_decl_file   : 5
    <68f>   DW_AT_decl_line   : 498
    <691>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0x33b>
    <696>   DW_AT_data_member_location: 76
 <2><697>: Abbrev Number: 8 (DW_TAG_member)
    <698>   DW_AT_name        : OR
    <69b>   DW_AT_decl_file   : 5
    <69c>   DW_AT_decl_line   : 499
    <69e>   DW_AT_decl_column : 17
    <69f>   DW_AT_type        : <0x33b>
    <6a3>   DW_AT_data_member_location: 80
 <2><6a4>: Abbrev Number: 0
 <1><6a5>: Abbrev Number: 10 (DW_TAG_typedef)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x86d47): TIM_TypeDef
    <6aa>   DW_AT_decl_file   : 5
    <6ab>   DW_AT_decl_line   : 500
    <6ad>   DW_AT_decl_column : 2
    <6ae>   DW_AT_type        : <0x576>
 <1><6b2>: Abbrev Number: 2 (DW_TAG_base_type)
    <6b3>   DW_AT_byte_size   : 8
    <6b4>   DW_AT_encoding    : 4	(float)
    <6b5>   DW_AT_name        : (indirect string, offset: 0xcbc8): long double
 <1><6b9>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <6ba>   DW_AT_encoding    : 7	(unsigned)
    <6bb>   DW_AT_byte_size   : 1
    <6bc>   DW_AT_type        : <0x2b6>
    <6c0>   DW_AT_decl_file   : 6
    <6c1>   DW_AT_decl_line   : 40
    <6c2>   DW_AT_decl_column : 1
    <6c3>   DW_AT_sibling     : <0x6e0>
 <2><6c7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x8782d): HAL_OK
    <6cc>   DW_AT_const_value : 0
 <2><6cd>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x890d8): HAL_ERROR
    <6d2>   DW_AT_const_value : 1
 <2><6d3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x86992): HAL_BUSY
    <6d8>   DW_AT_const_value : 2
 <2><6d9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6da>   DW_AT_name        : (indirect string, offset: 0x874d9): HAL_TIMEOUT
    <6de>   DW_AT_const_value : 3
 <2><6df>: Abbrev Number: 0
 <1><6e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x85af5): HAL_StatusTypeDef
    <6e5>   DW_AT_decl_file   : 6
    <6e6>   DW_AT_decl_line   : 45
    <6e7>   DW_AT_decl_column : 3
    <6e8>   DW_AT_type        : <0x6b9>
 <1><6ec>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <6ed>   DW_AT_encoding    : 7	(unsigned)
    <6ee>   DW_AT_byte_size   : 1
    <6ef>   DW_AT_type        : <0x2b6>
    <6f3>   DW_AT_decl_file   : 6
    <6f4>   DW_AT_decl_line   : 51
    <6f5>   DW_AT_decl_column : 1
    <6f6>   DW_AT_sibling     : <0x707>
 <2><6fa>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x89bbd): HAL_UNLOCKED
    <6ff>   DW_AT_const_value : 0
 <2><700>: Abbrev Number: 12 (DW_TAG_enumerator)
    <701>   DW_AT_name        : (indirect string, offset: 0x8b0fe): HAL_LOCKED
    <705>   DW_AT_const_value : 1
 <2><706>: Abbrev Number: 0
 <1><707>: Abbrev Number: 3 (DW_TAG_typedef)
    <708>   DW_AT_name        : (indirect string, offset: 0x88e2c): HAL_LockTypeDef
    <70c>   DW_AT_decl_file   : 6
    <70d>   DW_AT_decl_line   : 54
    <70e>   DW_AT_decl_column : 3
    <70f>   DW_AT_type        : <0x6ec>
 <1><713>: Abbrev Number: 13 (DW_TAG_structure_type)
    <714>   DW_AT_byte_size   : 12
    <715>   DW_AT_decl_file   : 7
    <716>   DW_AT_decl_line   : 49
    <717>   DW_AT_decl_column : 9
    <718>   DW_AT_sibling     : <0x744>
 <2><71c>: Abbrev Number: 14 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x895cd): PLLState
    <721>   DW_AT_decl_file   : 7
    <722>   DW_AT_decl_line   : 51
    <723>   DW_AT_decl_column : 12
    <724>   DW_AT_type        : <0x32f>
    <728>   DW_AT_data_member_location: 0
 <2><729>: Abbrev Number: 14 (DW_TAG_member)
    <72a>   DW_AT_name        : (indirect string, offset: 0x895fc): PLLSource
    <72e>   DW_AT_decl_file   : 7
    <72f>   DW_AT_decl_line   : 54
    <730>   DW_AT_decl_column : 12
    <731>   DW_AT_type        : <0x32f>
    <735>   DW_AT_data_member_location: 4
 <2><736>: Abbrev Number: 14 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x8a924): PLLMUL
    <73b>   DW_AT_decl_file   : 7
    <73c>   DW_AT_decl_line   : 57
    <73d>   DW_AT_decl_column : 12
    <73e>   DW_AT_type        : <0x32f>
    <742>   DW_AT_data_member_location: 8
 <2><743>: Abbrev Number: 0
 <1><744>: Abbrev Number: 3 (DW_TAG_typedef)
    <745>   DW_AT_name        : (indirect string, offset: 0x88f53): RCC_PLLInitTypeDef
    <749>   DW_AT_decl_file   : 7
    <74a>   DW_AT_decl_line   : 59
    <74b>   DW_AT_decl_column : 3
    <74c>   DW_AT_type        : <0x713>
 <1><750>: Abbrev Number: 13 (DW_TAG_structure_type)
    <751>   DW_AT_byte_size   : 20
    <752>   DW_AT_decl_file   : 7
    <753>   DW_AT_decl_line   : 64
    <754>   DW_AT_decl_column : 9
    <755>   DW_AT_sibling     : <0x79b>
 <2><759>: Abbrev Number: 14 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0x875d3): ClockType
    <75e>   DW_AT_decl_file   : 7
    <75f>   DW_AT_decl_line   : 66
    <760>   DW_AT_decl_column : 12
    <761>   DW_AT_type        : <0x32f>
    <765>   DW_AT_data_member_location: 0
 <2><766>: Abbrev Number: 14 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x88f2a): SYSCLKSource
    <76b>   DW_AT_decl_file   : 7
    <76c>   DW_AT_decl_line   : 69
    <76d>   DW_AT_decl_column : 12
    <76e>   DW_AT_type        : <0x32f>
    <772>   DW_AT_data_member_location: 4
 <2><773>: Abbrev Number: 14 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0x8a201): AHBCLKDivider
    <778>   DW_AT_decl_file   : 7
    <779>   DW_AT_decl_line   : 72
    <77a>   DW_AT_decl_column : 12
    <77b>   DW_AT_type        : <0x32f>
    <77f>   DW_AT_data_member_location: 8
 <2><780>: Abbrev Number: 14 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0x85cde): APB1CLKDivider
    <785>   DW_AT_decl_file   : 7
    <786>   DW_AT_decl_line   : 75
    <787>   DW_AT_decl_column : 12
    <788>   DW_AT_type        : <0x32f>
    <78c>   DW_AT_data_member_location: 12
 <2><78d>: Abbrev Number: 14 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x8844c): APB2CLKDivider
    <792>   DW_AT_decl_file   : 7
    <793>   DW_AT_decl_line   : 78
    <794>   DW_AT_decl_column : 12
    <795>   DW_AT_type        : <0x32f>
    <799>   DW_AT_data_member_location: 16
 <2><79a>: Abbrev Number: 0
 <1><79b>: Abbrev Number: 3 (DW_TAG_typedef)
    <79c>   DW_AT_name        : (indirect string, offset: 0x875dd): RCC_ClkInitTypeDef
    <7a0>   DW_AT_decl_file   : 7
    <7a1>   DW_AT_decl_line   : 80
    <7a2>   DW_AT_decl_column : 3
    <7a3>   DW_AT_type        : <0x750>
 <1><7a7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <7a8>   DW_AT_byte_size   : 40
    <7a9>   DW_AT_decl_file   : 8
    <7aa>   DW_AT_decl_line   : 228
    <7ab>   DW_AT_decl_column : 9
    <7ac>   DW_AT_sibling     : <0x81a>
 <2><7b0>: Abbrev Number: 14 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x85dfa): OscillatorType
    <7b5>   DW_AT_decl_file   : 8
    <7b6>   DW_AT_decl_line   : 230
    <7b7>   DW_AT_decl_column : 12
    <7b8>   DW_AT_type        : <0x32f>
    <7bc>   DW_AT_data_member_location: 0
 <2><7bd>: Abbrev Number: 14 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x895f3): HSEState
    <7c2>   DW_AT_decl_file   : 8
    <7c3>   DW_AT_decl_line   : 238
    <7c4>   DW_AT_decl_column : 12
    <7c5>   DW_AT_type        : <0x32f>
    <7c9>   DW_AT_data_member_location: 4
 <2><7ca>: Abbrev Number: 14 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x895e4): HSEPredivValue
    <7cf>   DW_AT_decl_file   : 8
    <7d0>   DW_AT_decl_line   : 241
    <7d1>   DW_AT_decl_column : 12
    <7d2>   DW_AT_type        : <0x32f>
    <7d6>   DW_AT_data_member_location: 8
 <2><7d7>: Abbrev Number: 14 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x891f5): LSEState
    <7dc>   DW_AT_decl_file   : 8
    <7dd>   DW_AT_decl_line   : 244
    <7de>   DW_AT_decl_column : 12
    <7df>   DW_AT_type        : <0x32f>
    <7e3>   DW_AT_data_member_location: 12
 <2><7e4>: Abbrev Number: 14 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x882e3): HSIState
    <7e9>   DW_AT_decl_file   : 8
    <7ea>   DW_AT_decl_line   : 247
    <7eb>   DW_AT_decl_column : 12
    <7ec>   DW_AT_type        : <0x32f>
    <7f0>   DW_AT_data_member_location: 16
 <2><7f1>: Abbrev Number: 14 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x8a554): HSICalibrationValue
    <7f6>   DW_AT_decl_file   : 8
    <7f7>   DW_AT_decl_line   : 250
    <7f8>   DW_AT_decl_column : 12
    <7f9>   DW_AT_type        : <0x32f>
    <7fd>   DW_AT_data_member_location: 20
 <2><7fe>: Abbrev Number: 14 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x8a8a7): LSIState
    <803>   DW_AT_decl_file   : 8
    <804>   DW_AT_decl_line   : 253
    <805>   DW_AT_decl_column : 12
    <806>   DW_AT_type        : <0x32f>
    <80a>   DW_AT_data_member_location: 24
 <2><80b>: Abbrev Number: 8 (DW_TAG_member)
    <80c>   DW_AT_name        : PLL
    <810>   DW_AT_decl_file   : 8
    <811>   DW_AT_decl_line   : 256
    <813>   DW_AT_decl_column : 22
    <814>   DW_AT_type        : <0x744>
    <818>   DW_AT_data_member_location: 28
 <2><819>: Abbrev Number: 0
 <1><81a>: Abbrev Number: 10 (DW_TAG_typedef)
    <81b>   DW_AT_name        : (indirect string, offset: 0x8892f): RCC_OscInitTypeDef
    <81f>   DW_AT_decl_file   : 8
    <820>   DW_AT_decl_line   : 261
    <822>   DW_AT_decl_column : 3
    <823>   DW_AT_type        : <0x7a7>
 <1><827>: Abbrev Number: 13 (DW_TAG_structure_type)
    <828>   DW_AT_byte_size   : 16
    <829>   DW_AT_decl_file   : 9
    <82a>   DW_AT_decl_line   : 47
    <82b>   DW_AT_decl_column : 9
    <82c>   DW_AT_sibling     : <0x865>
 <2><830>: Abbrev Number: 15 (DW_TAG_member)
    <831>   DW_AT_name        : Pin
    <835>   DW_AT_decl_file   : 9
    <836>   DW_AT_decl_line   : 49
    <837>   DW_AT_decl_column : 12
    <838>   DW_AT_type        : <0x32f>
    <83c>   DW_AT_data_member_location: 0
 <2><83d>: Abbrev Number: 14 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x8d78b): Mode
    <842>   DW_AT_decl_file   : 9
    <843>   DW_AT_decl_line   : 52
    <844>   DW_AT_decl_column : 12
    <845>   DW_AT_type        : <0x32f>
    <849>   DW_AT_data_member_location: 4
 <2><84a>: Abbrev Number: 14 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x85b43): Pull
    <84f>   DW_AT_decl_file   : 9
    <850>   DW_AT_decl_line   : 55
    <851>   DW_AT_decl_column : 12
    <852>   DW_AT_type        : <0x32f>
    <856>   DW_AT_data_member_location: 8
 <2><857>: Abbrev Number: 14 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0x8ad2e): Speed
    <85c>   DW_AT_decl_file   : 9
    <85d>   DW_AT_decl_line   : 58
    <85e>   DW_AT_decl_column : 12
    <85f>   DW_AT_type        : <0x32f>
    <863>   DW_AT_data_member_location: 12
 <2><864>: Abbrev Number: 0
 <1><865>: Abbrev Number: 3 (DW_TAG_typedef)
    <866>   DW_AT_name        : (indirect string, offset: 0x8ab86): GPIO_InitTypeDef
    <86a>   DW_AT_decl_file   : 9
    <86b>   DW_AT_decl_line   : 60
    <86c>   DW_AT_decl_column : 3
    <86d>   DW_AT_type        : <0x827>
 <1><871>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <872>   DW_AT_encoding    : 7	(unsigned)
    <873>   DW_AT_byte_size   : 1
    <874>   DW_AT_type        : <0x2b6>
    <878>   DW_AT_decl_file   : 9
    <879>   DW_AT_decl_line   : 66
    <87a>   DW_AT_decl_column : 1
    <87b>   DW_AT_sibling     : <0x88c>
 <2><87f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <880>   DW_AT_name        : (indirect string, offset: 0x86c86): GPIO_PIN_RESET
    <884>   DW_AT_const_value : 0
 <2><885>: Abbrev Number: 12 (DW_TAG_enumerator)
    <886>   DW_AT_name        : (indirect string, offset: 0x869d0): GPIO_PIN_SET
    <88a>   DW_AT_const_value : 1
 <2><88b>: Abbrev Number: 0
 <1><88c>: Abbrev Number: 3 (DW_TAG_typedef)
    <88d>   DW_AT_name        : (indirect string, offset: 0x8afde): GPIO_PinState
    <891>   DW_AT_decl_file   : 9
    <892>   DW_AT_decl_line   : 69
    <893>   DW_AT_decl_column : 3
    <894>   DW_AT_type        : <0x871>
 <1><898>: Abbrev Number: 13 (DW_TAG_structure_type)
    <899>   DW_AT_byte_size   : 28
    <89a>   DW_AT_decl_file   : 10
    <89b>   DW_AT_decl_line   : 48
    <89c>   DW_AT_decl_column : 9
    <89d>   DW_AT_sibling     : <0x8fd>
 <2><8a1>: Abbrev Number: 14 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x8cbb9): Direction
    <8a6>   DW_AT_decl_file   : 10
    <8a7>   DW_AT_decl_line   : 50
    <8a8>   DW_AT_decl_column : 12
    <8a9>   DW_AT_type        : <0x32f>
    <8ad>   DW_AT_data_member_location: 0
 <2><8ae>: Abbrev Number: 14 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0x85e8c): PeriphInc
    <8b3>   DW_AT_decl_file   : 10
    <8b4>   DW_AT_decl_line   : 54
    <8b5>   DW_AT_decl_column : 12
    <8b6>   DW_AT_type        : <0x32f>
    <8ba>   DW_AT_data_member_location: 4
 <2><8bb>: Abbrev Number: 14 (DW_TAG_member)
    <8bc>   DW_AT_name        : (indirect string, offset: 0x865c7): MemInc
    <8c0>   DW_AT_decl_file   : 10
    <8c1>   DW_AT_decl_line   : 57
    <8c2>   DW_AT_decl_column : 12
    <8c3>   DW_AT_type        : <0x32f>
    <8c7>   DW_AT_data_member_location: 8
 <2><8c8>: Abbrev Number: 14 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x88763): PeriphDataAlignment
    <8cd>   DW_AT_decl_file   : 10
    <8ce>   DW_AT_decl_line   : 60
    <8cf>   DW_AT_decl_column : 12
    <8d0>   DW_AT_type        : <0x32f>
    <8d4>   DW_AT_data_member_location: 12
 <2><8d5>: Abbrev Number: 14 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x8a9a4): MemDataAlignment
    <8da>   DW_AT_decl_file   : 10
    <8db>   DW_AT_decl_line   : 63
    <8dc>   DW_AT_decl_column : 12
    <8dd>   DW_AT_type        : <0x32f>
    <8e1>   DW_AT_data_member_location: 16
 <2><8e2>: Abbrev Number: 14 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x8d78b): Mode
    <8e7>   DW_AT_decl_file   : 10
    <8e8>   DW_AT_decl_line   : 66
    <8e9>   DW_AT_decl_column : 12
    <8ea>   DW_AT_type        : <0x32f>
    <8ee>   DW_AT_data_member_location: 20
 <2><8ef>: Abbrev Number: 14 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x8c024): Priority
    <8f4>   DW_AT_decl_file   : 10
    <8f5>   DW_AT_decl_line   : 71
    <8f6>   DW_AT_decl_column : 12
    <8f7>   DW_AT_type        : <0x32f>
    <8fb>   DW_AT_data_member_location: 24
 <2><8fc>: Abbrev Number: 0
 <1><8fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x873c3): DMA_InitTypeDef
    <902>   DW_AT_decl_file   : 10
    <903>   DW_AT_decl_line   : 73
    <904>   DW_AT_decl_column : 3
    <905>   DW_AT_type        : <0x898>
 <1><909>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <90a>   DW_AT_encoding    : 7	(unsigned)
    <90b>   DW_AT_byte_size   : 1
    <90c>   DW_AT_type        : <0x2b6>
    <910>   DW_AT_decl_file   : 10
    <911>   DW_AT_decl_line   : 79
    <912>   DW_AT_decl_column : 1
    <913>   DW_AT_sibling     : <0x930>
 <2><917>: Abbrev Number: 12 (DW_TAG_enumerator)
    <918>   DW_AT_name        : (indirect string, offset: 0x89c5c): HAL_DMA_STATE_RESET
    <91c>   DW_AT_const_value : 0
 <2><91d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <91e>   DW_AT_name        : (indirect string, offset: 0x87429): HAL_DMA_STATE_READY
    <922>   DW_AT_const_value : 1
 <2><923>: Abbrev Number: 12 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x89843): HAL_DMA_STATE_BUSY
    <928>   DW_AT_const_value : 2
 <2><929>: Abbrev Number: 12 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x8b01b): HAL_DMA_STATE_TIMEOUT
    <92e>   DW_AT_const_value : 3
 <2><92f>: Abbrev Number: 0
 <1><930>: Abbrev Number: 3 (DW_TAG_typedef)
    <931>   DW_AT_name        : (indirect string, offset: 0x89563): HAL_DMA_StateTypeDef
    <935>   DW_AT_decl_file   : 10
    <936>   DW_AT_decl_line   : 84
    <937>   DW_AT_decl_column : 2
    <938>   DW_AT_type        : <0x909>
 <1><93c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <93d>   DW_AT_name        : (indirect string, offset: 0x8a519): __DMA_HandleTypeDef
    <941>   DW_AT_byte_size   : 68
    <942>   DW_AT_decl_file   : 10
    <943>   DW_AT_decl_line   : 111
    <944>   DW_AT_decl_column : 16
    <945>   DW_AT_sibling     : <0x9e6>
 <2><949>: Abbrev Number: 14 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x87e60): Instance
    <94e>   DW_AT_decl_file   : 10
    <94f>   DW_AT_decl_line   : 113
    <950>   DW_AT_decl_column : 26
    <951>   DW_AT_type        : <0x9e6>
    <955>   DW_AT_data_member_location: 0
 <2><956>: Abbrev Number: 14 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x8a15e): Init
    <95b>   DW_AT_decl_file   : 10
    <95c>   DW_AT_decl_line   : 115
    <95d>   DW_AT_decl_column : 25
    <95e>   DW_AT_type        : <0x8fd>
    <962>   DW_AT_data_member_location: 4
 <2><963>: Abbrev Number: 14 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x5f939): Lock
    <968>   DW_AT_decl_file   : 10
    <969>   DW_AT_decl_line   : 117
    <96a>   DW_AT_decl_column : 25
    <96b>   DW_AT_type        : <0x707>
    <96f>   DW_AT_data_member_location: 32
 <2><970>: Abbrev Number: 14 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x895f6): State
    <975>   DW_AT_decl_file   : 10
    <976>   DW_AT_decl_line   : 119
    <977>   DW_AT_decl_column : 25
    <978>   DW_AT_type        : <0x930>
    <97c>   DW_AT_data_member_location: 33
 <2><97d>: Abbrev Number: 14 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x8ae08): Parent
    <982>   DW_AT_decl_file   : 10
    <983>   DW_AT_decl_line   : 121
    <984>   DW_AT_decl_column : 26
    <985>   DW_AT_type        : <0x9ec>
    <989>   DW_AT_data_member_location: 36
 <2><98a>: Abbrev Number: 14 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0x8b063): XferCpltCallback
    <98f>   DW_AT_decl_file   : 10
    <990>   DW_AT_decl_line   : 123
    <991>   DW_AT_decl_column : 28
    <992>   DW_AT_type        : <0x9ff>
    <996>   DW_AT_data_member_location: 40
 <2><997>: Abbrev Number: 14 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0x89f2d): XferHalfCpltCallback
    <99c>   DW_AT_decl_file   : 10
    <99d>   DW_AT_decl_line   : 125
    <99e>   DW_AT_decl_column : 28
    <99f>   DW_AT_type        : <0x9ff>
    <9a3>   DW_AT_data_member_location: 44
 <2><9a4>: Abbrev Number: 14 (DW_TAG_member)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x864bb): XferErrorCallback
    <9a9>   DW_AT_decl_file   : 10
    <9aa>   DW_AT_decl_line   : 127
    <9ab>   DW_AT_decl_column : 28
    <9ac>   DW_AT_type        : <0x9ff>
    <9b0>   DW_AT_data_member_location: 48
 <2><9b1>: Abbrev Number: 14 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x8ac1e): XferAbortCallback
    <9b6>   DW_AT_decl_file   : 10
    <9b7>   DW_AT_decl_line   : 129
    <9b8>   DW_AT_decl_column : 28
    <9b9>   DW_AT_type        : <0x9ff>
    <9bd>   DW_AT_data_member_location: 52
 <2><9be>: Abbrev Number: 14 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x8af55): ErrorCode
    <9c3>   DW_AT_decl_file   : 10
    <9c4>   DW_AT_decl_line   : 131
    <9c5>   DW_AT_decl_column : 25
    <9c6>   DW_AT_type        : <0x33b>
    <9ca>   DW_AT_data_member_location: 56
 <2><9cb>: Abbrev Number: 14 (DW_TAG_member)
    <9cc>   DW_AT_name        : (indirect string, offset: 0x8813f): DmaBaseAddress
    <9d0>   DW_AT_decl_file   : 10
    <9d1>   DW_AT_decl_line   : 133
    <9d2>   DW_AT_decl_column : 27
    <9d3>   DW_AT_type        : <0xa05>
    <9d7>   DW_AT_data_member_location: 60
 <2><9d8>: Abbrev Number: 14 (DW_TAG_member)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x86c95): ChannelIndex
    <9dd>   DW_AT_decl_file   : 10
    <9de>   DW_AT_decl_line   : 135
    <9df>   DW_AT_decl_column : 26
    <9e0>   DW_AT_type        : <0x32f>
    <9e4>   DW_AT_data_member_location: 64
 <2><9e5>: Abbrev Number: 0
 <1><9e6>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <9e7>   DW_AT_byte_size   : 4
    <9e8>   DW_AT_type        : <0x383>
 <1><9ec>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
 <1><9ee>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <9ef>   DW_AT_prototyped  : 1
    <9ef>   DW_AT_sibling     : <0x9f9>
 <2><9f3>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9f4>   DW_AT_type        : <0x9f9>
 <2><9f8>: Abbrev Number: 0
 <1><9f9>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <9fa>   DW_AT_byte_size   : 4
    <9fb>   DW_AT_type        : <0x93c>
 <1><9ff>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <a00>   DW_AT_byte_size   : 4
    <a01>   DW_AT_type        : <0x9ee>
 <1><a05>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
    <a07>   DW_AT_type        : <0x3b7>
 <1><a0b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x8a51b): DMA_HandleTypeDef
    <a10>   DW_AT_decl_file   : 10
    <a11>   DW_AT_decl_line   : 137
    <a12>   DW_AT_decl_column : 3
    <a13>   DW_AT_type        : <0x93c>
 <1><a17>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a18>   DW_AT_byte_size   : 32
    <a19>   DW_AT_decl_file   : 11
    <a1a>   DW_AT_decl_line   : 48
    <a1b>   DW_AT_decl_column : 9
    <a1c>   DW_AT_sibling     : <0xa89>
 <2><a20>: Abbrev Number: 14 (DW_TAG_member)
    <a21>   DW_AT_name        : (indirect string, offset: 0x8ad29): ClockSpeed
    <a25>   DW_AT_decl_file   : 11
    <a26>   DW_AT_decl_line   : 50
    <a27>   DW_AT_decl_column : 12
    <a28>   DW_AT_type        : <0x32f>
    <a2c>   DW_AT_data_member_location: 0
 <2><a2d>: Abbrev Number: 14 (DW_TAG_member)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x88f6b): DutyCycle
    <a32>   DW_AT_decl_file   : 11
    <a33>   DW_AT_decl_line   : 53
    <a34>   DW_AT_decl_column : 12
    <a35>   DW_AT_type        : <0x32f>
    <a39>   DW_AT_data_member_location: 4
 <2><a3a>: Abbrev Number: 14 (DW_TAG_member)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x87ab1): OwnAddress1
    <a3f>   DW_AT_decl_file   : 11
    <a40>   DW_AT_decl_line   : 56
    <a41>   DW_AT_decl_column : 12
    <a42>   DW_AT_type        : <0x32f>
    <a46>   DW_AT_data_member_location: 8
 <2><a47>: Abbrev Number: 14 (DW_TAG_member)
    <a48>   DW_AT_name        : (indirect string, offset: 0x88130): AddressingMode
    <a4c>   DW_AT_decl_file   : 11
    <a4d>   DW_AT_decl_line   : 59
    <a4e>   DW_AT_decl_column : 12
    <a4f>   DW_AT_type        : <0x32f>
    <a53>   DW_AT_data_member_location: 12
 <2><a54>: Abbrev Number: 14 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x899d8): DualAddressMode
    <a59>   DW_AT_decl_file   : 11
    <a5a>   DW_AT_decl_line   : 62
    <a5b>   DW_AT_decl_column : 12
    <a5c>   DW_AT_type        : <0x32f>
    <a60>   DW_AT_data_member_location: 16
 <2><a61>: Abbrev Number: 14 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x87abd): OwnAddress2
    <a66>   DW_AT_decl_file   : 11
    <a67>   DW_AT_decl_line   : 65
    <a68>   DW_AT_decl_column : 12
    <a69>   DW_AT_type        : <0x32f>
    <a6d>   DW_AT_data_member_location: 20
 <2><a6e>: Abbrev Number: 14 (DW_TAG_member)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x86852): GeneralCallMode
    <a73>   DW_AT_decl_file   : 11
    <a74>   DW_AT_decl_line   : 68
    <a75>   DW_AT_decl_column : 12
    <a76>   DW_AT_type        : <0x32f>
    <a7a>   DW_AT_data_member_location: 24
 <2><a7b>: Abbrev Number: 14 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x87603): NoStretchMode
    <a80>   DW_AT_decl_file   : 11
    <a81>   DW_AT_decl_line   : 71
    <a82>   DW_AT_decl_column : 12
    <a83>   DW_AT_type        : <0x32f>
    <a87>   DW_AT_data_member_location: 28
 <2><a88>: Abbrev Number: 0
 <1><a89>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x8768b): I2C_InitTypeDef
    <a8e>   DW_AT_decl_file   : 11
    <a8f>   DW_AT_decl_line   : 74
    <a90>   DW_AT_decl_column : 3
    <a91>   DW_AT_type        : <0xa17>
 <1><a95>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <a96>   DW_AT_encoding    : 7	(unsigned)
    <a97>   DW_AT_byte_size   : 1
    <a98>   DW_AT_type        : <0x2b6>
    <a9c>   DW_AT_decl_file   : 11
    <a9d>   DW_AT_decl_line   : 108
    <a9e>   DW_AT_decl_column : 1
    <a9f>   DW_AT_sibling     : <0xae6>
 <2><aa3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <aa4>   DW_AT_name        : (indirect string, offset: 0x85d46): HAL_I2C_STATE_RESET
    <aa8>   DW_AT_const_value : 0
 <2><aa9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x8771c): HAL_I2C_STATE_READY
    <aae>   DW_AT_const_value : 32
 <2><aaf>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ab0>   DW_AT_name        : (indirect string, offset: 0x898be): HAL_I2C_STATE_BUSY
    <ab4>   DW_AT_const_value : 36
 <2><ab5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x607e1): HAL_I2C_STATE_BUSY_TX
    <aba>   DW_AT_const_value : 33
 <2><abb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <abc>   DW_AT_name        : (indirect string, offset: 0x2ec3d): HAL_I2C_STATE_BUSY_RX
    <ac0>   DW_AT_const_value : 34
 <2><ac1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x87e69): HAL_I2C_STATE_LISTEN
    <ac6>   DW_AT_const_value : 40
 <2><ac7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x87041): HAL_I2C_STATE_BUSY_TX_LISTEN
    <acc>   DW_AT_const_value : 41
 <2><acd>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ace>   DW_AT_name        : (indirect string, offset: 0x896fe): HAL_I2C_STATE_BUSY_RX_LISTEN
    <ad2>   DW_AT_const_value : 42
 <2><ad3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x87c22): HAL_I2C_STATE_ABORT
    <ad8>   DW_AT_const_value : 96
 <2><ad9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ada>   DW_AT_name        : (indirect string, offset: 0x8a399): HAL_I2C_STATE_TIMEOUT
    <ade>   DW_AT_const_value : 160
 <2><adf>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x8aa2b): HAL_I2C_STATE_ERROR
    <ae4>   DW_AT_const_value : 224
 <2><ae5>: Abbrev Number: 0
 <1><ae6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x868ff): HAL_I2C_StateTypeDef
    <aeb>   DW_AT_decl_file   : 11
    <aec>   DW_AT_decl_line   : 123
    <aed>   DW_AT_decl_column : 3
    <aee>   DW_AT_type        : <0xa95>
 <1><af2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <af3>   DW_AT_type        : <0xae6>
 <1><af7>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <af8>   DW_AT_encoding    : 7	(unsigned)
    <af9>   DW_AT_byte_size   : 1
    <afa>   DW_AT_type        : <0x2b6>
    <afe>   DW_AT_decl_file   : 11
    <aff>   DW_AT_decl_line   : 148
    <b00>   DW_AT_decl_column : 1
    <b01>   DW_AT_sibling     : <0xb1e>
 <2><b05>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b06>   DW_AT_name        : (indirect string, offset: 0x8737f): HAL_I2C_MODE_NONE
    <b0a>   DW_AT_const_value : 0
 <2><b0b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x85b18): HAL_I2C_MODE_MASTER
    <b10>   DW_AT_const_value : 16
 <2><b11>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b12>   DW_AT_name        : (indirect string, offset: 0x8aadb): HAL_I2C_MODE_SLAVE
    <b16>   DW_AT_const_value : 32
 <2><b17>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b18>   DW_AT_name        : (indirect string, offset: 0x8767a): HAL_I2C_MODE_MEM
    <b1c>   DW_AT_const_value : 64
 <2><b1d>: Abbrev Number: 0
 <1><b1e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x885f2): HAL_I2C_ModeTypeDef
    <b23>   DW_AT_decl_file   : 11
    <b24>   DW_AT_decl_line   : 154
    <b25>   DW_AT_decl_column : 3
    <b26>   DW_AT_type        : <0xaf7>
 <1><b2a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b2b>   DW_AT_type        : <0xb1e>
 <1><b2f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b30>   DW_AT_byte_size   : 84
    <b31>   DW_AT_decl_file   : 11
    <b32>   DW_AT_decl_line   : 188
    <b33>   DW_AT_decl_column : 9
    <b34>   DW_AT_sibling     : <0xc16>
 <2><b38>: Abbrev Number: 14 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x87e60): Instance
    <b3d>   DW_AT_decl_file   : 11
    <b3e>   DW_AT_decl_line   : 191
    <b3f>   DW_AT_decl_column : 31
    <b40>   DW_AT_type        : <0xc16>
    <b44>   DW_AT_data_member_location: 0
 <2><b45>: Abbrev Number: 14 (DW_TAG_member)
    <b46>   DW_AT_name        : (indirect string, offset: 0x8a15e): Init
    <b4a>   DW_AT_decl_file   : 11
    <b4b>   DW_AT_decl_line   : 193
    <b4c>   DW_AT_decl_column : 30
    <b4d>   DW_AT_type        : <0xa89>
    <b51>   DW_AT_data_member_location: 4
 <2><b52>: Abbrev Number: 14 (DW_TAG_member)
    <b53>   DW_AT_name        : (indirect string, offset: 0x860fa): pBuffPtr
    <b57>   DW_AT_decl_file   : 11
    <b58>   DW_AT_decl_line   : 195
    <b59>   DW_AT_decl_column : 31
    <b5a>   DW_AT_type        : <0xc1c>
    <b5e>   DW_AT_data_member_location: 36
 <2><b5f>: Abbrev Number: 14 (DW_TAG_member)
    <b60>   DW_AT_name        : (indirect string, offset: 0x878a0): XferSize
    <b64>   DW_AT_decl_file   : 11
    <b65>   DW_AT_decl_line   : 197
    <b66>   DW_AT_decl_column : 30
    <b67>   DW_AT_type        : <0x319>
    <b6b>   DW_AT_data_member_location: 40
 <2><b6c>: Abbrev Number: 14 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0x89856): XferCount
    <b71>   DW_AT_decl_file   : 11
    <b72>   DW_AT_decl_line   : 199
    <b73>   DW_AT_decl_column : 30
    <b74>   DW_AT_type        : <0x325>
    <b78>   DW_AT_data_member_location: 42
 <2><b79>: Abbrev Number: 14 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x8c5cb): XferOptions
    <b7e>   DW_AT_decl_file   : 11
    <b7f>   DW_AT_decl_line   : 201
    <b80>   DW_AT_decl_column : 30
    <b81>   DW_AT_type        : <0x33b>
    <b85>   DW_AT_data_member_location: 44
 <2><b86>: Abbrev Number: 14 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x882c0): PreviousState
    <b8b>   DW_AT_decl_file   : 11
    <b8c>   DW_AT_decl_line   : 203
    <b8d>   DW_AT_decl_column : 30
    <b8e>   DW_AT_type        : <0x33b>
    <b92>   DW_AT_data_member_location: 48
 <2><b93>: Abbrev Number: 14 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0x8af4e): hdmatx
    <b98>   DW_AT_decl_file   : 11
    <b99>   DW_AT_decl_line   : 206
    <b9a>   DW_AT_decl_column : 31
    <b9b>   DW_AT_type        : <0xc22>
    <b9f>   DW_AT_data_member_location: 52
 <2><ba0>: Abbrev Number: 14 (DW_TAG_member)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x8aef8): hdmarx
    <ba5>   DW_AT_decl_file   : 11
    <ba6>   DW_AT_decl_line   : 208
    <ba7>   DW_AT_decl_column : 31
    <ba8>   DW_AT_type        : <0xc22>
    <bac>   DW_AT_data_member_location: 56
 <2><bad>: Abbrev Number: 14 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0x5f939): Lock
    <bb2>   DW_AT_decl_file   : 11
    <bb3>   DW_AT_decl_line   : 210
    <bb4>   DW_AT_decl_column : 30
    <bb5>   DW_AT_type        : <0x707>
    <bb9>   DW_AT_data_member_location: 60
 <2><bba>: Abbrev Number: 14 (DW_TAG_member)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x895f6): State
    <bbf>   DW_AT_decl_file   : 11
    <bc0>   DW_AT_decl_line   : 212
    <bc1>   DW_AT_decl_column : 30
    <bc2>   DW_AT_type        : <0xaf2>
    <bc6>   DW_AT_data_member_location: 61
 <2><bc7>: Abbrev Number: 14 (DW_TAG_member)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x8d78b): Mode
    <bcc>   DW_AT_decl_file   : 11
    <bcd>   DW_AT_decl_line   : 214
    <bce>   DW_AT_decl_column : 30
    <bcf>   DW_AT_type        : <0xb2a>
    <bd3>   DW_AT_data_member_location: 62
 <2><bd4>: Abbrev Number: 14 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x8af55): ErrorCode
    <bd9>   DW_AT_decl_file   : 11
    <bda>   DW_AT_decl_line   : 216
    <bdb>   DW_AT_decl_column : 30
    <bdc>   DW_AT_type        : <0x33b>
    <be0>   DW_AT_data_member_location: 64
 <2><be1>: Abbrev Number: 14 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x893c3): Devaddress
    <be6>   DW_AT_decl_file   : 11
    <be7>   DW_AT_decl_line   : 218
    <be8>   DW_AT_decl_column : 30
    <be9>   DW_AT_type        : <0x33b>
    <bed>   DW_AT_data_member_location: 68
 <2><bee>: Abbrev Number: 14 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0x88fbc): Memaddress
    <bf3>   DW_AT_decl_file   : 11
    <bf4>   DW_AT_decl_line   : 220
    <bf5>   DW_AT_decl_column : 30
    <bf6>   DW_AT_type        : <0x33b>
    <bfa>   DW_AT_data_member_location: 72
 <2><bfb>: Abbrev Number: 14 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x8852e): MemaddSize
    <c00>   DW_AT_decl_file   : 11
    <c01>   DW_AT_decl_line   : 222
    <c02>   DW_AT_decl_column : 30
    <c03>   DW_AT_type        : <0x33b>
    <c07>   DW_AT_data_member_location: 76
 <2><c08>: Abbrev Number: 14 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x885ab): EventCount
    <c0d>   DW_AT_decl_file   : 11
    <c0e>   DW_AT_decl_line   : 224
    <c0f>   DW_AT_decl_column : 30
    <c10>   DW_AT_type        : <0x33b>
    <c14>   DW_AT_data_member_location: 80
 <2><c15>: Abbrev Number: 0
 <1><c16>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c17>   DW_AT_byte_size   : 4
    <c18>   DW_AT_type        : <0x4c6>
 <1><c1c>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c1d>   DW_AT_byte_size   : 4
    <c1e>   DW_AT_type        : <0x30d>
 <1><c22>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c23>   DW_AT_byte_size   : 4
    <c24>   DW_AT_type        : <0xa0b>
 <1><c28>: Abbrev Number: 3 (DW_TAG_typedef)
    <c29>   DW_AT_name        : (indirect string, offset: 0x8786f): I2C_HandleTypeDef
    <c2d>   DW_AT_decl_file   : 11
    <c2e>   DW_AT_decl_line   : 244
    <c2f>   DW_AT_decl_column : 3
    <c30>   DW_AT_type        : <0xb2f>
 <1><c34>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c35>   DW_AT_byte_size   : 24
    <c36>   DW_AT_decl_file   : 12
    <c37>   DW_AT_decl_line   : 47
    <c38>   DW_AT_decl_column : 9
    <c39>   DW_AT_sibling     : <0xc8c>
 <2><c3d>: Abbrev Number: 14 (DW_TAG_member)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x8d89d): Prescaler
    <c42>   DW_AT_decl_file   : 12
    <c43>   DW_AT_decl_line   : 49
    <c44>   DW_AT_decl_column : 12
    <c45>   DW_AT_type        : <0x32f>
    <c49>   DW_AT_data_member_location: 0
 <2><c4a>: Abbrev Number: 14 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x8aa3f): CounterMode
    <c4f>   DW_AT_decl_file   : 12
    <c50>   DW_AT_decl_line   : 52
    <c51>   DW_AT_decl_column : 12
    <c52>   DW_AT_type        : <0x32f>
    <c56>   DW_AT_data_member_location: 4
 <2><c57>: Abbrev Number: 14 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0x92dac): Period
    <c5c>   DW_AT_decl_file   : 12
    <c5d>   DW_AT_decl_line   : 55
    <c5e>   DW_AT_decl_column : 12
    <c5f>   DW_AT_type        : <0x32f>
    <c63>   DW_AT_data_member_location: 8
 <2><c64>: Abbrev Number: 14 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x87f4f): ClockDivision
    <c69>   DW_AT_decl_file   : 12
    <c6a>   DW_AT_decl_line   : 59
    <c6b>   DW_AT_decl_column : 12
    <c6c>   DW_AT_type        : <0x32f>
    <c70>   DW_AT_data_member_location: 12
 <2><c71>: Abbrev Number: 14 (DW_TAG_member)
    <c72>   DW_AT_name        : (indirect string, offset: 0x898d6): RepetitionCounter
    <c76>   DW_AT_decl_file   : 12
    <c77>   DW_AT_decl_line   : 62
    <c78>   DW_AT_decl_column : 12
    <c79>   DW_AT_type        : <0x32f>
    <c7d>   DW_AT_data_member_location: 16
 <2><c7e>: Abbrev Number: 14 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x86118): AutoReloadPreload
    <c83>   DW_AT_decl_file   : 12
    <c84>   DW_AT_decl_line   : 73
    <c85>   DW_AT_decl_column : 12
    <c86>   DW_AT_type        : <0x32f>
    <c8a>   DW_AT_data_member_location: 20
 <2><c8b>: Abbrev Number: 0
 <1><c8c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x8a90f): TIM_Base_InitTypeDef
    <c91>   DW_AT_decl_file   : 12
    <c92>   DW_AT_decl_line   : 75
    <c93>   DW_AT_decl_column : 3
    <c94>   DW_AT_type        : <0xc34>
 <1><c98>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c99>   DW_AT_byte_size   : 16
    <c9a>   DW_AT_decl_file   : 12
    <c9b>   DW_AT_decl_line   : 199
    <c9c>   DW_AT_decl_column : 9
    <c9d>   DW_AT_sibling     : <0xcd6>
 <2><ca1>: Abbrev Number: 14 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x8657c): ClockSource
    <ca6>   DW_AT_decl_file   : 12
    <ca7>   DW_AT_decl_line   : 201
    <ca8>   DW_AT_decl_column : 12
    <ca9>   DW_AT_type        : <0x32f>
    <cad>   DW_AT_data_member_location: 0
 <2><cae>: Abbrev Number: 14 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0x88b2e): ClockPolarity
    <cb3>   DW_AT_decl_file   : 12
    <cb4>   DW_AT_decl_line   : 203
    <cb5>   DW_AT_decl_column : 12
    <cb6>   DW_AT_type        : <0x32f>
    <cba>   DW_AT_data_member_location: 4
 <2><cbb>: Abbrev Number: 14 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x8a6ca): ClockPrescaler
    <cc0>   DW_AT_decl_file   : 12
    <cc1>   DW_AT_decl_line   : 205
    <cc2>   DW_AT_decl_column : 12
    <cc3>   DW_AT_type        : <0x32f>
    <cc7>   DW_AT_data_member_location: 8
 <2><cc8>: Abbrev Number: 14 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x89374): ClockFilter
    <ccd>   DW_AT_decl_file   : 12
    <cce>   DW_AT_decl_line   : 207
    <ccf>   DW_AT_decl_column : 12
    <cd0>   DW_AT_type        : <0x32f>
    <cd4>   DW_AT_data_member_location: 12
 <2><cd5>: Abbrev Number: 0
 <1><cd6>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x85c2a): TIM_ClockConfigTypeDef
    <cdb>   DW_AT_decl_file   : 12
    <cdc>   DW_AT_decl_line   : 209
    <cdd>   DW_AT_decl_column : 3
    <cde>   DW_AT_type        : <0xc98>
 <1><ce2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ce3>   DW_AT_byte_size   : 8
    <ce4>   DW_AT_decl_file   : 12
    <ce5>   DW_AT_decl_line   : 232
    <ce6>   DW_AT_decl_column : 9
    <ce7>   DW_AT_sibling     : <0xd06>
 <2><ceb>: Abbrev Number: 14 (DW_TAG_member)
    <cec>   DW_AT_name        : (indirect string, offset: 0x88e18): MasterOutputTrigger
    <cf0>   DW_AT_decl_file   : 12
    <cf1>   DW_AT_decl_line   : 234
    <cf2>   DW_AT_decl_column : 13
    <cf3>   DW_AT_type        : <0x32f>
    <cf7>   DW_AT_data_member_location: 0
 <2><cf8>: Abbrev Number: 14 (DW_TAG_member)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x888de): MasterSlaveMode
    <cfd>   DW_AT_decl_file   : 12
    <cfe>   DW_AT_decl_line   : 236
    <cff>   DW_AT_decl_column : 13
    <d00>   DW_AT_type        : <0x32f>
    <d04>   DW_AT_data_member_location: 4
 <2><d05>: Abbrev Number: 0
 <1><d06>: Abbrev Number: 3 (DW_TAG_typedef)
    <d07>   DW_AT_name        : (indirect string, offset: 0x89a34): TIM_MasterConfigTypeDef
    <d0b>   DW_AT_decl_file   : 12
    <d0c>   DW_AT_decl_line   : 243
    <d0d>   DW_AT_decl_column : 3
    <d0e>   DW_AT_type        : <0xce2>
 <1><d12>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d13>   DW_AT_encoding    : 7	(unsigned)
    <d14>   DW_AT_byte_size   : 1
    <d15>   DW_AT_type        : <0x2b6>
    <d19>   DW_AT_decl_file   : 12
    <d1a>   DW_AT_decl_line   : 292
    <d1c>   DW_AT_decl_column : 1
    <d1d>   DW_AT_sibling     : <0xd40>
 <2><d21>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d22>   DW_AT_name        : (indirect string, offset: 0x887c5): HAL_TIM_STATE_RESET
    <d26>   DW_AT_const_value : 0
 <2><d27>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d28>   DW_AT_name        : (indirect string, offset: 0x85cb8): HAL_TIM_STATE_READY
    <d2c>   DW_AT_const_value : 1
 <2><d2d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d2e>   DW_AT_name        : (indirect string, offset: 0x87322): HAL_TIM_STATE_BUSY
    <d32>   DW_AT_const_value : 2
 <2><d33>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d34>   DW_AT_name        : (indirect string, offset: 0x8a3ee): HAL_TIM_STATE_TIMEOUT
    <d38>   DW_AT_const_value : 3
 <2><d39>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x87b66): HAL_TIM_STATE_ERROR
    <d3e>   DW_AT_const_value : 4
 <2><d3f>: Abbrev Number: 0
 <1><d40>: Abbrev Number: 10 (DW_TAG_typedef)
    <d41>   DW_AT_name        : (indirect string, offset: 0x89a67): HAL_TIM_StateTypeDef
    <d45>   DW_AT_decl_file   : 12
    <d46>   DW_AT_decl_line   : 298
    <d48>   DW_AT_decl_column : 3
    <d49>   DW_AT_type        : <0xd12>
 <1><d4d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d4e>   DW_AT_type        : <0xd40>
 <1><d52>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d53>   DW_AT_encoding    : 7	(unsigned)
    <d54>   DW_AT_byte_size   : 1
    <d55>   DW_AT_type        : <0x2b6>
    <d59>   DW_AT_decl_file   : 12
    <d5a>   DW_AT_decl_line   : 304
    <d5c>   DW_AT_decl_column : 1
    <d5d>   DW_AT_sibling     : <0xd74>
 <2><d61>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d62>   DW_AT_name        : (indirect string, offset: 0x879e4): HAL_TIM_CHANNEL_STATE_RESET
    <d66>   DW_AT_const_value : 0
 <2><d67>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d68>   DW_AT_name        : (indirect string, offset: 0x88dfc): HAL_TIM_CHANNEL_STATE_READY
    <d6c>   DW_AT_const_value : 1
 <2><d6d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x885b6): HAL_TIM_CHANNEL_STATE_BUSY
    <d72>   DW_AT_const_value : 2
 <2><d73>: Abbrev Number: 0
 <1><d74>: Abbrev Number: 10 (DW_TAG_typedef)
    <d75>   DW_AT_name        : (indirect string, offset: 0x86ce7): HAL_TIM_ChannelStateTypeDef
    <d79>   DW_AT_decl_file   : 12
    <d7a>   DW_AT_decl_line   : 308
    <d7c>   DW_AT_decl_column : 3
    <d7d>   DW_AT_type        : <0xd52>
 <1><d81>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d82>   DW_AT_type        : <0xd74>
 <1><d86>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d87>   DW_AT_encoding    : 7	(unsigned)
    <d88>   DW_AT_byte_size   : 1
    <d89>   DW_AT_type        : <0x2b6>
    <d8d>   DW_AT_decl_file   : 12
    <d8e>   DW_AT_decl_line   : 314
    <d90>   DW_AT_decl_column : 1
    <d91>   DW_AT_sibling     : <0xda8>
 <2><d95>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d96>   DW_AT_name        : (indirect string, offset: 0x85b58): HAL_DMA_BURST_STATE_RESET
    <d9a>   DW_AT_const_value : 0
 <2><d9b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x88a35): HAL_DMA_BURST_STATE_READY
    <da0>   DW_AT_const_value : 1
 <2><da1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <da2>   DW_AT_name        : (indirect string, offset: 0x89ce4): HAL_DMA_BURST_STATE_BUSY
    <da6>   DW_AT_const_value : 2
 <2><da7>: Abbrev Number: 0
 <1><da8>: Abbrev Number: 10 (DW_TAG_typedef)
    <da9>   DW_AT_name        : (indirect string, offset: 0x8644f): HAL_TIM_DMABurstStateTypeDef
    <dad>   DW_AT_decl_file   : 12
    <dae>   DW_AT_decl_line   : 318
    <db0>   DW_AT_decl_column : 3
    <db1>   DW_AT_type        : <0xd86>
 <1><db5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <db6>   DW_AT_type        : <0xda8>
 <1><dba>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <dbb>   DW_AT_encoding    : 7	(unsigned)
    <dbc>   DW_AT_byte_size   : 1
    <dbd>   DW_AT_type        : <0x2b6>
    <dc1>   DW_AT_decl_file   : 12
    <dc2>   DW_AT_decl_line   : 324
    <dc4>   DW_AT_decl_column : 1
    <dc5>   DW_AT_sibling     : <0xde8>
 <2><dc9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dca>   DW_AT_name        : (indirect string, offset: 0x88bbc): HAL_TIM_ACTIVE_CHANNEL_1
    <dce>   DW_AT_const_value : 1
 <2><dcf>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dd0>   DW_AT_name        : (indirect string, offset: 0x88bd5): HAL_TIM_ACTIVE_CHANNEL_2
    <dd4>   DW_AT_const_value : 2
 <2><dd5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x88bee): HAL_TIM_ACTIVE_CHANNEL_3
    <dda>   DW_AT_const_value : 4
 <2><ddb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x88c07): HAL_TIM_ACTIVE_CHANNEL_4
    <de0>   DW_AT_const_value : 8
 <2><de1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <de2>   DW_AT_name        : (indirect string, offset: 0x87fdc): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <de6>   DW_AT_const_value : 0
 <2><de7>: Abbrev Number: 0
 <1><de8>: Abbrev Number: 10 (DW_TAG_typedef)
    <de9>   DW_AT_name        : (indirect string, offset: 0x86c70): HAL_TIM_ActiveChannel
    <ded>   DW_AT_decl_file   : 12
    <dee>   DW_AT_decl_line   : 330
    <df0>   DW_AT_decl_column : 3
    <df1>   DW_AT_type        : <0xdba>
 <1><df5>: Abbrev Number: 7 (DW_TAG_structure_type)
    <df6>   DW_AT_byte_size   : 72
    <df7>   DW_AT_decl_file   : 12
    <df8>   DW_AT_decl_line   : 338
    <dfa>   DW_AT_decl_column : 9
    <dfb>   DW_AT_sibling     : <0xe7e>
 <2><dff>: Abbrev Number: 9 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0x87e60): Instance
    <e04>   DW_AT_decl_file   : 12
    <e05>   DW_AT_decl_line   : 341
    <e07>   DW_AT_decl_column : 39
    <e08>   DW_AT_type        : <0xe7e>
    <e0c>   DW_AT_data_member_location: 0
 <2><e0d>: Abbrev Number: 9 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x8a15e): Init
    <e12>   DW_AT_decl_file   : 12
    <e13>   DW_AT_decl_line   : 342
    <e15>   DW_AT_decl_column : 38
    <e16>   DW_AT_type        : <0xc8c>
    <e1a>   DW_AT_data_member_location: 4
 <2><e1b>: Abbrev Number: 9 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x86c7e): Channel
    <e20>   DW_AT_decl_file   : 12
    <e21>   DW_AT_decl_line   : 343
    <e23>   DW_AT_decl_column : 38
    <e24>   DW_AT_type        : <0xde8>
    <e28>   DW_AT_data_member_location: 28
 <2><e29>: Abbrev Number: 9 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x88efc): hdma
    <e2e>   DW_AT_decl_file   : 12
    <e2f>   DW_AT_decl_line   : 344
    <e31>   DW_AT_decl_column : 39
    <e32>   DW_AT_type        : <0xe84>
    <e36>   DW_AT_data_member_location: 32
 <2><e37>: Abbrev Number: 9 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x5f939): Lock
    <e3c>   DW_AT_decl_file   : 12
    <e3d>   DW_AT_decl_line   : 346
    <e3f>   DW_AT_decl_column : 38
    <e40>   DW_AT_type        : <0x707>
    <e44>   DW_AT_data_member_location: 60
 <2><e45>: Abbrev Number: 9 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x895f6): State
    <e4a>   DW_AT_decl_file   : 12
    <e4b>   DW_AT_decl_line   : 347
    <e4d>   DW_AT_decl_column : 38
    <e4e>   DW_AT_type        : <0xd4d>
    <e52>   DW_AT_data_member_location: 61
 <2><e53>: Abbrev Number: 9 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0x8dde2): ChannelState
    <e58>   DW_AT_decl_file   : 12
    <e59>   DW_AT_decl_line   : 348
    <e5b>   DW_AT_decl_column : 38
    <e5c>   DW_AT_type        : <0xea4>
    <e60>   DW_AT_data_member_location: 62
 <2><e61>: Abbrev Number: 9 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x8e375): ChannelNState
    <e66>   DW_AT_decl_file   : 12
    <e67>   DW_AT_decl_line   : 349
    <e69>   DW_AT_decl_column : 38
    <e6a>   DW_AT_type        : <0xea4>
    <e6e>   DW_AT_data_member_location: 66
 <2><e6f>: Abbrev Number: 9 (DW_TAG_member)
    <e70>   DW_AT_name        : (indirect string, offset: 0x8d95b): DMABurstState
    <e74>   DW_AT_decl_file   : 12
    <e75>   DW_AT_decl_line   : 350
    <e77>   DW_AT_decl_column : 38
    <e78>   DW_AT_type        : <0xdb5>
    <e7c>   DW_AT_data_member_location: 70
 <2><e7d>: Abbrev Number: 0
 <1><e7e>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <e7f>   DW_AT_byte_size   : 4
    <e80>   DW_AT_type        : <0x6a5>
 <1><e84>: Abbrev Number: 22 (DW_TAG_array_type)
    <e85>   DW_AT_type        : <0xc22>
    <e89>   DW_AT_sibling     : <0xe94>
 <2><e8d>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <e8e>   DW_AT_type        : <0x306>
    <e92>   DW_AT_upper_bound : 6
 <2><e93>: Abbrev Number: 0
 <1><e94>: Abbrev Number: 22 (DW_TAG_array_type)
    <e95>   DW_AT_type        : <0xd81>
    <e99>   DW_AT_sibling     : <0xea4>
 <2><e9d>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <e9e>   DW_AT_type        : <0x306>
    <ea2>   DW_AT_upper_bound : 3
 <2><ea3>: Abbrev Number: 0
 <1><ea4>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ea5>   DW_AT_type        : <0xe94>
 <1><ea9>: Abbrev Number: 10 (DW_TAG_typedef)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x87881): TIM_HandleTypeDef
    <eae>   DW_AT_decl_file   : 12
    <eaf>   DW_AT_decl_line   : 381
    <eb1>   DW_AT_decl_column : 3
    <eb2>   DW_AT_type        : <0xdf5>
 <1><eb6>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <eb7>   DW_AT_encoding    : 5	(signed)
    <eb8>   DW_AT_byte_size   : 4
    <eb9>   DW_AT_type        : <0x2ff>
    <ebd>   DW_AT_decl_file   : 13
    <ebe>   DW_AT_decl_line   : 82
    <ebf>   DW_AT_decl_column : 14
    <ec0>   DW_AT_sibling     : <0x1006>
 <2><ec4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x8750b): osPriorityNone
    <ec9>   DW_AT_const_value : 0
 <2><eca>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x8a69f): osPriorityIdle
    <ecf>   DW_AT_const_value : 1
 <2><ed0>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x8ad5b): osPriorityLow
    <ed5>   DW_AT_const_value : 8
 <2><ed6>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x86edc): osPriorityLow1
    <edb>   DW_AT_const_value : 9
 <2><edc>: Abbrev Number: 12 (DW_TAG_enumerator)
    <edd>   DW_AT_name        : (indirect string, offset: 0x8ad69): osPriorityLow2
    <ee1>   DW_AT_const_value : 10
 <2><ee2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x8ad78): osPriorityLow3
    <ee7>   DW_AT_const_value : 11
 <2><ee8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x8ad87): osPriorityLow4
    <eed>   DW_AT_const_value : 12
 <2><eee>: Abbrev Number: 12 (DW_TAG_enumerator)
    <eef>   DW_AT_name        : (indirect string, offset: 0x87bcb): osPriorityLow5
    <ef3>   DW_AT_const_value : 13
 <2><ef4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x8ad96): osPriorityLow6
    <ef9>   DW_AT_const_value : 14
 <2><efa>: Abbrev Number: 12 (DW_TAG_enumerator)
    <efb>   DW_AT_name        : (indirect string, offset: 0x8ada5): osPriorityLow7
    <eff>   DW_AT_const_value : 15
 <2><f00>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f01>   DW_AT_name        : (indirect string, offset: 0x8ae95): osPriorityBelowNormal
    <f05>   DW_AT_const_value : 16
 <2><f06>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f07>   DW_AT_name        : (indirect string, offset: 0x8883b): osPriorityBelowNormal1
    <f0b>   DW_AT_const_value : 17
 <2><f0c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x89e17): osPriorityBelowNormal2
    <f11>   DW_AT_const_value : 18
 <2><f12>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f13>   DW_AT_name        : (indirect string, offset: 0x88f01): osPriorityBelowNormal3
    <f17>   DW_AT_const_value : 19
 <2><f18>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f19>   DW_AT_name        : (indirect string, offset: 0x8a41f): osPriorityBelowNormal4
    <f1d>   DW_AT_const_value : 20
 <2><f1e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x8a436): osPriorityBelowNormal5
    <f23>   DW_AT_const_value : 21
 <2><f24>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x8a44d): osPriorityBelowNormal6
    <f29>   DW_AT_const_value : 22
 <2><f2a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x8a464): osPriorityBelowNormal7
    <f2f>   DW_AT_const_value : 23
 <2><f30>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0x88777): osPriorityNormal
    <f35>   DW_AT_const_value : 24
 <2><f36>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x867b0): osPriorityNormal1
    <f3b>   DW_AT_const_value : 25
 <2><f3c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x867c2): osPriorityNormal2
    <f41>   DW_AT_const_value : 26
 <2><f42>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x867d4): osPriorityNormal3
    <f47>   DW_AT_const_value : 27
 <2><f48>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x867e6): osPriorityNormal4
    <f4d>   DW_AT_const_value : 28
 <2><f4e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x867f8): osPriorityNormal5
    <f53>   DW_AT_const_value : 29
 <2><f54>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0x8680a): osPriorityNormal6
    <f59>   DW_AT_const_value : 30
 <2><f5a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x8681c): osPriorityNormal7
    <f5f>   DW_AT_const_value : 31
 <2><f60>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0x870f3): osPriorityAboveNormal
    <f65>   DW_AT_const_value : 32
 <2><f66>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f67>   DW_AT_name        : (indirect string, offset: 0x8b074): osPriorityAboveNormal1
    <f6b>   DW_AT_const_value : 33
 <2><f6c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x8b08b): osPriorityAboveNormal2
    <f71>   DW_AT_const_value : 34
 <2><f72>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f73>   DW_AT_name        : (indirect string, offset: 0x8b0a2): osPriorityAboveNormal3
    <f77>   DW_AT_const_value : 35
 <2><f78>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f79>   DW_AT_name        : (indirect string, offset: 0x8b0b9): osPriorityAboveNormal4
    <f7d>   DW_AT_const_value : 36
 <2><f7e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x8acdf): osPriorityAboveNormal5
    <f83>   DW_AT_const_value : 37
 <2><f84>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f85>   DW_AT_name        : (indirect string, offset: 0x8b0d0): osPriorityAboveNormal6
    <f89>   DW_AT_const_value : 38
 <2><f8a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x8b0e7): osPriorityAboveNormal7
    <f8f>   DW_AT_const_value : 39
 <2><f90>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f91>   DW_AT_name        : (indirect string, offset: 0x8a568): osPriorityHigh
    <f95>   DW_AT_const_value : 40
 <2><f96>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f97>   DW_AT_name        : (indirect string, offset: 0x89503): osPriorityHigh1
    <f9b>   DW_AT_const_value : 41
 <2><f9c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x89513): osPriorityHigh2
    <fa1>   DW_AT_const_value : 42
 <2><fa2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x89523): osPriorityHigh3
    <fa7>   DW_AT_const_value : 43
 <2><fa8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x89533): osPriorityHigh4
    <fad>   DW_AT_const_value : 44
 <2><fae>: Abbrev Number: 12 (DW_TAG_enumerator)
    <faf>   DW_AT_name        : (indirect string, offset: 0x85b48): osPriorityHigh5
    <fb3>   DW_AT_const_value : 45
 <2><fb4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x89543): osPriorityHigh6
    <fb9>   DW_AT_const_value : 46
 <2><fba>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fbb>   DW_AT_name        : (indirect string, offset: 0x89553): osPriorityHigh7
    <fbf>   DW_AT_const_value : 47
 <2><fc0>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x8a9fb): osPriorityRealtime
    <fc5>   DW_AT_const_value : 48
 <2><fc6>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x890e2): osPriorityRealtime1
    <fcb>   DW_AT_const_value : 49
 <2><fcc>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x890f6): osPriorityRealtime2
    <fd1>   DW_AT_const_value : 50
 <2><fd2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x8910a): osPriorityRealtime3
    <fd7>   DW_AT_const_value : 51
 <2><fd8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x8911e): osPriorityRealtime4
    <fdd>   DW_AT_const_value : 52
 <2><fde>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x89132): osPriorityRealtime5
    <fe3>   DW_AT_const_value : 53
 <2><fe4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x89146): osPriorityRealtime6
    <fe9>   DW_AT_const_value : 54
 <2><fea>: Abbrev Number: 12 (DW_TAG_enumerator)
    <feb>   DW_AT_name        : (indirect string, offset: 0x8915a): osPriorityRealtime7
    <fef>   DW_AT_const_value : 55
 <2><ff0>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x883a9): osPriorityISR
    <ff5>   DW_AT_const_value : 56
 <2><ff6>: Abbrev Number: 24 (DW_TAG_enumerator)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x8a6de): osPriorityError
    <ffb>   DW_AT_const_value : -1
 <2><ffc>: Abbrev Number: 25 (DW_TAG_enumerator)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x8adf5): osPriorityReserved
    <1001>   DW_AT_const_value : 0x7fffffff
 <2><1005>: Abbrev Number: 0
 <1><1006>: Abbrev Number: 3 (DW_TAG_typedef)
    <1007>   DW_AT_name        : (indirect string, offset: 0x86f58): osPriority_t
    <100b>   DW_AT_decl_file   : 13
    <100c>   DW_AT_decl_line   : 136
    <100d>   DW_AT_decl_column : 3
    <100e>   DW_AT_type        : <0xeb6>
 <1><1012>: Abbrev Number: 3 (DW_TAG_typedef)
    <1013>   DW_AT_name        : (indirect string, offset: 0x88990): osThreadFunc_t
    <1017>   DW_AT_decl_file   : 13
    <1018>   DW_AT_decl_line   : 139
    <1019>   DW_AT_decl_column : 16
    <101a>   DW_AT_type        : <0x101e>
 <1><101e>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <101f>   DW_AT_byte_size   : 4
    <1020>   DW_AT_type        : <0x1024>
 <1><1024>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <1025>   DW_AT_prototyped  : 1
    <1025>   DW_AT_sibling     : <0x102f>
 <2><1029>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <102a>   DW_AT_type        : <0x9ec>
 <2><102e>: Abbrev Number: 0
 <1><102f>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <1030>   DW_AT_encoding    : 5	(signed)
    <1031>   DW_AT_byte_size   : 4
    <1032>   DW_AT_type        : <0x2ff>
    <1036>   DW_AT_decl_file   : 13
    <1037>   DW_AT_decl_line   : 176
    <1038>   DW_AT_decl_column : 14
    <1039>   DW_AT_sibling     : <0x1071>
 <2><103d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <103e>   DW_AT_name        : (indirect string, offset: 0x8a6d9): osOK
    <1042>   DW_AT_const_value : 0
 <2><1043>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1044>   DW_AT_name        : (indirect string, offset: 0x8848c): osError
    <1048>   DW_AT_const_value : -1
 <2><1049>: Abbrev Number: 24 (DW_TAG_enumerator)
    <104a>   DW_AT_name        : (indirect string, offset: 0x8a995): osErrorTimeout
    <104e>   DW_AT_const_value : -2
 <2><104f>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1050>   DW_AT_name        : (indirect string, offset: 0x894b6): osErrorResource
    <1054>   DW_AT_const_value : -3
 <2><1055>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1056>   DW_AT_name        : (indirect string, offset: 0x8736e): osErrorParameter
    <105a>   DW_AT_const_value : -4
 <2><105b>: Abbrev Number: 24 (DW_TAG_enumerator)
    <105c>   DW_AT_name        : (indirect string, offset: 0x8694a): osErrorNoMemory
    <1060>   DW_AT_const_value : -5
 <2><1061>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1062>   DW_AT_name        : (indirect string, offset: 0x873ea): osErrorISR
    <1066>   DW_AT_const_value : -6
 <2><1067>: Abbrev Number: 25 (DW_TAG_enumerator)
    <1068>   DW_AT_name        : (indirect string, offset: 0x887b4): osStatusReserved
    <106c>   DW_AT_const_value : 0x7fffffff
 <2><1070>: Abbrev Number: 0
 <1><1071>: Abbrev Number: 3 (DW_TAG_typedef)
    <1072>   DW_AT_name        : (indirect string, offset: 0x87864): osStatus_t
    <1076>   DW_AT_decl_file   : 13
    <1077>   DW_AT_decl_line   : 185
    <1078>   DW_AT_decl_column : 3
    <1079>   DW_AT_type        : <0x102f>
 <1><107d>: Abbrev Number: 3 (DW_TAG_typedef)
    <107e>   DW_AT_name        : (indirect string, offset: 0x87a0b): osThreadId_t
    <1082>   DW_AT_decl_file   : 13
    <1083>   DW_AT_decl_line   : 189
    <1084>   DW_AT_decl_column : 15
    <1085>   DW_AT_type        : <0x9ec>
 <1><1089>: Abbrev Number: 3 (DW_TAG_typedef)
    <108a>   DW_AT_name        : (indirect string, offset: 0x895d6): TZ_ModuleId_t
    <108e>   DW_AT_decl_file   : 13
    <108f>   DW_AT_decl_line   : 213
    <1090>   DW_AT_decl_column : 18
    <1091>   DW_AT_type        : <0x32f>
 <1><1095>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1096>   DW_AT_byte_size   : 36
    <1097>   DW_AT_decl_file   : 13
    <1098>   DW_AT_decl_line   : 218
    <1099>   DW_AT_decl_column : 9
    <109a>   DW_AT_sibling     : <0x1114>
 <2><109e>: Abbrev Number: 14 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0x8a90a): name
    <10a3>   DW_AT_decl_file   : 13
    <10a4>   DW_AT_decl_line   : 219
    <10a5>   DW_AT_decl_column : 33
    <10a6>   DW_AT_type        : <0x1114>
    <10aa>   DW_AT_data_member_location: 0
 <2><10ab>: Abbrev Number: 14 (DW_TAG_member)
